{"summary":[{"Profile":"\n\nA mid-level PMP candidate with extensive experience with reputed government & oilfield companies in UAE. Successfully worked as; Project Coordinator, Sr. Officer Administrator, Executive Assistant (Projects), HR Coordinator, Employee Relations Coordinator, PA and Marketing Assistant\n\nAdept in Communication with emphasis on building strong team relationships and acting as an efficient liaison between management and team members. Quick learner who can rapidly adapts to emerging technologies. Proven ability to achieve business goals and provide productive solutions.\n"}],"education_and_training":[{"Study":" individual cases and propose solutions in compliance with UAE Labor low.\n\nAnswer employees’ inquiries on immigration laws and coordinate with Government Relations Dept. in justifying individual cases.\n\nApply labour law and immigration law on all personnel issues\n\nCoordinate and follow up with PROs and Government Relations Section.\n\nUpdate personnel profiles and data on the SAP.\n\nPrepare reports for leave balances and clearances.\n\nAssist company staff in filling in all employee relations forms. i.e. Leave forms, educational assistance form, change in personal details form, shipping of personal effects form, accommodation request form, expense claim form, etc.\n\nProvide basic statistics on ER issues.\n\nCoordinate with sister departments & sections like payroll, government relations, and travel in handling Personnel formalities.\n\nTranslates confidential documents received from Government authorities and high ranking officials for Management.\n\nPrepare summery of weekly activities of the Division and ensure that all departments input is provided on time.\n\nCarry out follow up duties with Dept. Heads to ensure that deadlines are met and that necessary reports are provided on time.\n\nWork once a year on staff annual appraisals and handle RGT’s procedures and issue promotions, transfers & salary increases letters according to company criteria.\n\nCoordinate with ER members in final departure formalities.\n\nPrepare power point presentations as requested.\n\nDraft & type memos and letters to both company departments and employees and issue To Whom It May Concern letters as requested.\n\nReceive, dispatch mail and handle actions requested by Senior Employee Relations Officer.\n\nTrack the circulation of all forms to make sure of action.\n\nMaintain all staff personal files.\n\nAssist in the grand personal files scanning project.\n\nSr. Office Administrator\n\nADMA-OPCO (Abu Dhabi "},{"Training":"\n\nPMP Credential Exam Preparation Course (PMP) – Cambridge Educational Inst\n\nReport Writing (Arabic\/English) – GPCGIS\n\n"},{"Computer Courses":" recognized by the Computer Professional Association, UK\n"}],"skills":[{"Communication Skills":" – ADGAS\n\nPersonnel Practice – ADGAS\n\nOne-to-One negotiation skills-Bayer Ltd\n\nMarketing Concepts -Bayer Ltd\n\nConsumer Behaviour-Bayer Ltd\n\nSolving Conflicts and Negotiation Skills - Bayer Ltd\n\nGeneral Executive Secretary Course-Gama Computers\n\nProfessional Tourist Guiding Diploma-Egyptian Ministry of Tourism\n\n"},{"Skills":"\n\nComputer: Microsoft Office suite: Word, Excel, Power Point, Access, Visio, Oracle, Outlook, SAP, etc…\n\n"},{"Languages":": Arabic: mother tongue\n\nEnglish: fluently read, write and speak\n\nPersian (beginner)\n"}],"basics":{"name":{"surname":"Coordinator"},"title":"candidate"},"awards":[{"Achievements":"\n\nCreated and updated project’s dashboards including but not limited to: monthly, weekly & summary reports, KPI’s status log, AOP, Issues & Risk register, escalation requests, stakeholders\/coordinators’ database, MoMs, project’s document log and project’s deliverables log.\n\nEnsured timely submission of projects deliverables and conducted comprehensive wrap up quarterly and during stage\/ project handover processes.\n\nCoordinated creating and updating an access database for tracking project activities and extracting multiple reports according to multiple requirements.\n\nDeveloped Oracle HR reports and summaries in liaison with IT team.\n\nDrafted SOPs for several office procedures as per requirements.\n\nStreamlined timekeeping process by acquiring an online membership accounts for team members.\n"}],"work_experience":[{"date_start":"October 2000","jobtitle":"Marine","date_end":"July 2003","text":"\n\nPreparing weekly & monthly reports by co-ordinating with all concerned employees to receive data on time and form the final report for manager’s review.\n\nPreparing for shareholders meetings and make all needed arrangements: board room booking, presentation tools, snacks requests…etc.\n\nPrepare Leave Plan Chart and follow up with Human Resources Dept. for Leave Balances and Clearances.\n\nTesting candidates for Secretarial\/clerical vacancies, including typing speed test, written English test, word, excel, Power Point…etc.\n\nTranslating documents as required (English\/Arabic)-(Arabic\/English).\n\nMaintaining department's Personnel Files containing leave forms, related correspondence and training papers.\n\nDrafting all memos, faxes and letters for department head’s\/ GM’s signature and keeping appointments on the manager's outlook calendar.\n\nOriginating and submitting all security, maintenance, office equipment, printing and stationary request forms.\n\nRegistering, sorting and dispatching mail for department staff.\n\nMarketing Assistant, Consumer Care Dept.\n\n"},{"date_start":"August 98","organization":"Bayer","date_end":"July 2000","text":"\n\nDevelop and coordinate Trade Show & Seminar events.\n\nHands on work involving the preparation of displays, equipment and design, edit, , print, package media and equipment, ship, track, travel to\/from location, coordinate team & travel, assemble and put final touches. Coordinate daily event schedule.\n\nAssists in the development of promotional strategies and product development.\n\nPrepare Event Agenda, Invitations, Registration Forms and Payments\/Refunds tracking for Customer events.\n\nDevelop media packs & giveaways for trade shows and conferences.\n\nServes as liaison between the company and advertising agencies, freelance talent, print suppliers, and other marketing services.\n\nProvide administrative and personal support to Directors, coordinating travel arrangements, & preparing agendas & appointments.\n\nTrack prospective contacts, seminar attendees, event revenues & expense tracking.\n\nManage and track the expenses for each event. Ensure budget is managed properly.\n\nCoordinate Catered Events for Customer Visits & Staff Events including: Dinners, Luncheons\n\n   \n\nHR Assistant (Estates & Maintenance)\n\nADGAS (Abu Dhabi Gas Liquefaction Company)\n\n"},{"date_start":"July 96","organization":"Government","date_end":"July 98","text":" officials in processing staff accommodation and utilities issues.\n\nPrepare Lease Agreements for personnel housing.\n\nPrepare Housing Assessments according to surveyor's inspection.\n\nReceive maintenance requests and coordinate with external contractors to carry out the job.\n\nUpdate maintenance requests & reports in the estates and maintenance special software.\n\nCarry out all correspondence related to the section with property managements, landlords, government authorities.\n"},{"date_start":"1995","organization":"BA","text":".\n\nPreparing for PMP Certification Exam from PMI - USA\n"},{"Experience\nProject":" & Admin Coordinator\nGPC-Global Information Solutions (Rejoined)\n"},{"Project":": e-No Objection Certificates (e-NOC)\nClient: Abu Dhabi Systems & Information Center (ADSIC)\/ DMA\nApril 2013 – Present\n\nCompile, develop and circulate weekly and monthly reports\n\nPrepare monthly summary on project accomplishments for invoicing purpose.\n\n"},{"Update Project":" issues and risk register and reflect escalations on the weekly report.\n\nCreate and update activities tracking database for all project activities on weekly basis.\n\nCoordinate the Executive Manager’s appointments and update project’s calendar accordingly.\n\nUphold the confidentiality of the project, handling all information on a need to know basis.\n\nExtract milestones and deliverables form masterplan for AOP preparation.\n\nEnsure timely submission of projects deliverables and conduct comprehensive wrap up quarterly and during stage\/ project handover processes\n\nCoordinate with Head Office for SMEs visits, process consultants’\/ SME’s timesheets and invoices.\n\nConduct regular quality checks on project’s shared folder structure and contents.\n\nEnsures deliverables and\/or milestones and routine operational activities are to the client satisfaction.\n\nCoordinate project’s outreach and communication activities with client’s PR department.\n\nCoordinate set-ups for meetings and workshops, update calendars, prepare venue requisition, catering and assist where needed.\n\nSupport Business Development Manager in drafting bidding proposals\n\nSupport client in preparing some areas of RFPs\n\nLiaise between Executive Manager, project manager, team members, account managers and trainees in day-to-day office procedures.\n\nHandle sending workshop invitations to project’s community (40 stakeholders) and track responses.\n\nMaintain and update resources calendar.\n\nDraft and handle sending letters, memos and all sorts of correspondences and track required actions.\n\nDraft meeting minutes, follow up on action items and update tracking database and MoMs log accordingly.\n\nOrder and inventory office supplies to ensure the smooth operation of the office\n\nParticipate in organizing events, workshops, seminars, etc.\n\nScan job applications and summarize for management consideration.\nER Coordinator (ER Projects)\nHealth Authority-Abu Dhabi, HAAD\nJanuary 2012 – April 2013\n\nCollect and compile special projects data required by higher authorities on ER relevant matters\n\nInitiate Oracle record for newly joiners\n\nSupport newly hired employees & follow up hiring formalities with government relations section..\n\nFollow up complaints and disciplinary actions.\n\nIssue warning letters\n\nHandle issuing staff IDs, capturing ID photos and scan fingerprints.\n\nCommunicate with health insurance company and complete issuance procedures, claiming ...etc.\n\nCoordinate with IT, Finance, Procurement for logistics needs of ER section.\n\nCoordinate with Payroll Dept. for salary changes and updates.\n\nMaintain staff attendance on Smart-Time Software and manage amendments on daily basis.\n\nHandle filing, scanning & document controlling.\n\nSupport leaving employees in finalizing leaving formalities.\n\nIssue employment & salary certificates and other related ER letters.\n\nIssue experience certificates for leaving employees\n\nProvide professional admin. & logistic support to the ER team\n\nDraft Arabic\/English letters, memos, emails...etc.\n\nTranslate documents, correspondences, articles & presentations including subject terminologies and re-draft in proper format\n\nCompile documentations needed for certain commercial\/governmental applications.\n\nLiaise between Employee Relations, Government Relations & General Services sections.\n\nMaintain staff attendance and supervise attendance reports on daily basis.\n\nPrepare analysis and statistics as requested.\n\nSupport newly joined members (travel, accommodation, car rentals, and complete joining formalities. Etc.).\nExecutive Assistant (Projects)\nGPC-Global Information Solutions\n"},{"Project":": Abu Dhabi Spatial Data Infrastructure (AD-SDI)\nClient: Abu Dhabi Systems & Information Center (ADSIC)\nNovember 2009 – December 2011\n\nProvide quality administrative & logistic support to the Executive Manager, consultants and SMEs.\n\nCompile account managers inputs and prepare, revise and finalize the weekly report for PMO feedback.\n\nCoordinate meetings; sending invites and follow up acceptances.\n\nTake meeting minutes and follow up on action items.\n\nPrepare PowerPoint Presentations as requested.\n\nMaintain manager’s calendar, project’s calendar to be reflected in the Weekly Progress Report.\n\nPerform researches, analysis and statistics as requested.\n\nDraft Arabic\/English letters, memos, emails...etc.\n\nUpdate Admin. Lists and community dashboards.\n\nSchedule interviews, meeting, and events and arrange for conference\/workshops venue bookings.\n\nTranslates documents, correspondences, articles & presentations including subject terminologies and re-draft in proper format.\n\nSupport newly recruited employees (travel, accommodation, car rental .etc.)\n\nHandle staff accommodation\/maintenance arrangements.\n\nUpdate staff leave records & entitlements, and handle leave balance clearing on time.\n\nCoordinate with head office on day-to-day matters.\n\nLiaise with clients, section heads\/account managers in day-to-day office procedures\/tasks.\n\nParticipate in organizing events, workshops, seminars..etc.\n\nScan CVs and summarize for management consideration.\n\nCoordinate with the Head Office for SMEs visits.\n\nParticipated in organizing for the GIS day 18-19 November.\n\nPersonal Assistant - COO, Chief Operations Officer\n\nInostream Toys & Gifts Trading - Abu Dhabi, UAE.\nJuly 2005 –October 2009\n\nFollow up with all concerned authorities to complete foundation formalities.\n\nHandle shipping procedures with manufacturers, shippers, free zone...etc.\n\nHandle warehousing issues & distributing process.\n\nCoordinate with banks for LC’s & LG’s.\n\nRepresent company\/manufacturers in trade shows.\n\nEmployee Relations Coordinator\n\nADGAS (Abu Dhabi Gas Liquefaction Company)\nJuly 2003 – June 2005\n\nProvide quality service for Department staff in all related administrative procedures.\n\n"}],"misc":[{"Strength":" Points\n\nSelf-driven\n\nCreative\n\nHigh flare for numbers and analysis\n\nStrong organization and follow up skills\nUAE Visa Status\nResidence visa on husband’s sponsorship\nDriving License\n\nValid UAE driving license\n\nRasha Ahmed Aman\n\nAbu Dhabi, UAE, Mobile: +971 50 542 3925\n\ne-mail : ? HYPERLINK \"mailto:rashaaman@hotmail.com\" ?rashaaman@hotmail.com?\n\nRasha Ahmed Aman Page 1"}]}