{"summary":[{"SUMMARY":" OF EXPERIENCES\n\n12 years of Experience in Oil & Gas, & Petrochemical and Fertilizer Plant Power plant Operation and Maintenance & Commissioning & PMC.\n\n"},{"Highlights":" abnormalities and advises supervisor on corrective actions for discussions.\n\nCollects monthly plant production and operating data, evaluates unit efficiencies by relating chemical and energy consumption to plant throughput. Identifies possible trends, prepares reports with comments and submits to supervisor for review.\n\nMonitors equipment and systems performance, identifies potential problems and submits recommendations for appropriate actions such as revising operating modes or conditions, recommending chemical dosing and specifications, rescheduling of required shutdowns initiating chemical cleaning, proposing modifications to existing systems and following up to ensure proper execution. Issues the monthly plant health report.\n\nParticipates in the identification of possible solutions in process problem areas includes analyzing operating reports and discussing problem items with the department concerned.\n\nProvides functional assistance and analyses the results of special tests from operational units, in order to provide further information for analysis and \/ or to test check effectiveness of alterations. Involves close monitoring of test runs and close collaboration with the operations department.\n\nProvides technical services and assistance to other sections such as instrumentation, maintenance, inspection and materials as required. Includes investigating problems associated with process, diagnosing corrosion problems, preparing technical specifications of operating chemicals and other materials and carrying out the technical evaluation of bids for chemicals and catalysts.\n\nProvides comments on the drawings and P& I (piping and instrumentation) diagrams. Checks the process documentation issued by licensors for consistency. Follows up on detailed engineering of new projects, checks design calculations, engineering drawings and specifications and makes comments as appropriate.\n\nParticipates in HAZOP and HAZAN studies pertaining to proposed modifications, including identifying potential operational and safety related problems and coordinating appropriate solutions.\n\nDevelops computer programmers for process plants monitoring and yield prediction. Applies computer simulation models and other advanced techniques to achieve optimum plant performance. Assists computer support unit in working out process control strategies, systems analysis and modifications.\n\nLead the team of shift engineers\/technicians to planned production target with compliance of HSE regulations and in a timely manner with cost control.\n\nProcess involves oil\/gas separation, Gas compression, liquefaction and export. Glycol dehydration and regeneration, Gas turbine driven power generation and utilities like air compressors and Nitrogen generation and cooling water are closely monitored.\n\nProcess control through DCS and Process emergency shutdown through Triconex ESD system. Moreover PLC and SCADA are also used for remote operation. Ensure safe operation of the asset and operability of the plant.\n\nPigging operations for gas and liquid pipeline are routine.\n\nWell experienced in new project commissioning and tie ups.\n\nWrite operating procedures\/ guides for various processes, equipment’s and shutdown. Write training manual for each operating unit for national employees with specific methodology\n\nConduct HSE meeting, participate Facility inspection meeting, new project meeting and annual turn around meetings.\n\nCarry out routine checks on equipment for abnormalities and inform Superior for prompt action.\n\nPrepare the plant \/ equipment for maintenance ensuring adherence to standards\n\nCarry out duties as Auxiliary Fireman or Site Safety Officer as and when required during emergencies, as per the Facility Response Plan\n\nReceive chemicals, maintain the stock\/consumption register and prepare chemical batches required for the process ensuring adherence to procedures\n\nCheck process parameters and coordinate with Operator’s to correct any deviations.\n\nCarryout routine checks on equipment for abnormalities and inform Superior for prompt action.\n\nPrepare the plant \/ equipment’s for maintenance ensuring adherence to standards.\n\nPTW procedures for maintenance isolation and tagging.\n\nSign work permits, follow on-going jobs and monitor Contractors activities ensuring adherence to safety regulations and procedures. \n\nCarry out duties as Auxiliary fireman or Site Safety Officer as and when required during emergencies, as per the Facility Response Plan.\n\nFollow all relevant departmental policies, processes, standard operating procedures and instructions so that work is carried out in a controlled and consistent manner.\n\nReceive chemicals, maintain the stock\/consumption register and prepare chemical batches required for the process ensuring adherence to procedures.\n\nEnsure compliance to all relevant safety, quality and environmental management policies, procedures and controls to guarantee employee safety, legislative compliance, delivery of high quality products\/service and a responsible environmental attitude\n\nEvaluated, repaired equipment and controls, equipment, gauges, instruments and monitors\n\nEmergency response management and prevention of loss management. Firefighting and safety operation.\n\nEnsured safe, efficient operations and environmentally-friendly maintenance operations and proper disposal of excess gases\n\nMonitor all administrative functions as per requirement.\n\nMaintain and provide support to all, Total Safety Task Instruction (TSTI), 5 x Back 5, Tool box Talk (TBT) and Incident Injury Free (IIF) system\n\n"}],"skills":[{"SKILLS":"\n\nExcellent communication, decision-making skills\n\nManual dexterity and strong mechanical ability\n\nAnalytical, critical thinking and problem solving skills\n\nStrong computer skills\n\nAbility to work within a team environment\n\nSelf-motivated, capable of working with minimal supervision\n\nSupervisor leadership skills\n\nBehavioral Observation & Intervention ( BO&I )\n\n"}],"basics":{"name":{"surname":"Tech - Chemical"},"email":["pink_venkat82@yahoo.co.in"]},"awards":[{"AWARDS":"\n\nSafety Award @ GASCO - Habshan -5,Abu Dhabi (Nov’ 2012)\n\nSafety Award @ Kusu , Kuwait (Sep’ 2010)\n\nVenkatachalam Karuppan_CV\n"}],"work_experience":[{"WORKING EXPERIENCE":"\n\nApril 2015 – Still Day : TOYO Engineering Corporation\n\n{IEFCL (INDORAMA-Nigeria)} Chief Supervisor (U & O)\n\nJuly2013 – Jun 2014 : Japan Gas Corporation (JGC)\n\n{Barzan (Ras Gas)-Qatar} PMC Process Supervisor\n\n"},{"date_start":"June 2011","organization":"Hyundai","date_end":"Jan 2013","text":" Engineering &construction Co, Ltd\n\n{Habsan-5 (GASCO) – Abu Dhabi} Operator\n\n"},{"date_start":"Jan 2009","organization":"Hyundai","date_end":"Dec 2010","text":" Engineering &construction Co, Ltd\n\n(KUSU – Kuwait) Operator\n\n"},{"date_start":"May 2008","organization":"Hyundai","date_end":"Nov 2008","text":" Engineering &construction Co, Ltd\n\n{KNER (KNPC) – Kuwait} Operator\n\nApril 2002 – May 2008 : Thirumalai Chemicals Limited (Petrochemical Company)\n\nOperation Supervisor\n\nRESPONSIBILITIES\n\nPrepares daily performance summaries to monitor plant performance. Includes studying laboratory test reports, standard log sheets and other daily operating activities reports and compiling information for supervisors review. "}]}