{"summary":[{"Professional Summary":"\n\nHaving 4.4 years of experience in SAP ABAP, BODS and MDG at Ayan Tech Solutions Pvt Ltd.\n\nTeam player with strong ability to achieve quality results.\n\nGood problem solving skills with a strong technical background and good interpersonal skills.\n\nHaving good knowledge in testing, debugging, troubleshooting and code optimization.\n\nWorked on Reports, Data Dictionary and Module pool.\n\nWorked on BDC, BAPI, and LSMW.\n\nWorked on Customer Exits, BADI and enhancement.\n\nWorked on ALE-IDOC, SAP Note.\n\nWorked on SAP Script and Smartform.\n\nWorked on object oriented programming.\n\nHaving experience in ETL tool BODS. Worked on extraction, transformation and loading the data into SAP.\n\nHaving experience in MDG.\n\n"}],"education_and_training":[{"Education":" Details\n\nBachelor of Engineering in Computer Science from Anna University."}],"basics":{"gender":"male","name":{"firstName":"Kumar","surname":"Kashyap"},"title":"Consultant","email":["balamurugan.e@gmail.com"]},"work_experience":[{"date_start":"Sep 2012","jobtitle":"Consultant","date_end":"Sep 2014","text":".\n\nResponsibilities\/Deliverables:\n\nDeveloped a dashboard to release and reject the purchase requisition for overall and item wise. Then updated the status of release and reject using BAPI. Displayed the files attached to the respective purchase request using DMS.\n\nDeveloped a program for material requisition create, change and display. Then maintained the details of the material requisition in custom table and send mail to head about the material requisition for approval. Based on the material requisition, purchase requisitions create and change done using BDC.\n\nEnhancement has done to export the value from ME55 to custom report based on the release group.\n\nChanged the customer exit to reset the plant for rejected overall purchase requisition.\n\nDeveloped a function module for sales order change BAPI extension and updated the custom fields in sales order header table.\n\nDeveloped a report to display the time difference details of goods vehicle in-transit.\n\nRestricted the partial cancelation of invoice for particular movement type using Badi.\n\nDeveloped BDC program to upload customer master, condition master, material master initial stock upload and production version creation.\n\nDeveloped a program for yard reporting entry and yard reporting exit, then the details are maintained in custom table. Modified the existing script to print the yard reporting form.\n\nDeveloped a program to validate and upload cycle counter indicator for material based on the BI report.\n\nDeveloped function module for purchase order details along with customs table details.\n\nDeveloped a report to display the yard reporting details on periodic basis in ALV.\n\nDeveloped driver program for barcode printing of production order.\n\nInvolved in preparing technical specification for various objects.\n\nInvolved in performance tuning for various objects.\n\nImplemented SAP note manually for excel downloading time out error.\n\nInvolved in pre unit testing.\n\nTransported the transport requests from development server to quality server.\n\nClient : Fenner India\n\nRole : Technical "},{"date_start":"Apr 2012","jobtitle":"Consultant","date_end":"Aug 2012","text":"\n\nResponsibilities\/Deliverables:\n\nDeveloped a program for proforma invoice creation based on the quotation and updated the details in custom table. Proforma invoice number updated in VBAK table using BAPI. Then sent confirmation mail to the customer.\n\nDeveloped a program for proforma invoice change based on the proforma invoice created and updated the details using BAPI. Then sent confirmation mail to the customer.\n\nDeveloped a program to run in background to send notification mail every 24 hours about proforma invoice confirmation.\n\nInvolved in pre unit testing and performance tuning.\n\nClient : "},{"date_start":"Nov 2011","jobtitle":"Consultant","organization":"BHP Billiton","date_end":"Mar 2012","text":"\n\nResponsibilities\/Deliverables:\n\nInvolved in creating technical specifications development for objects Production version, MA Enrichment and APO characteristics value combination.\n\nDeveloped the objects to migrate cost center and customer master details using IDOC inbound process.\n\nDeveloped the objects with extraction, transformation, preload and post load validation jobs.\n\nCreated the report file for invalid records and missing records after the data loaded in to SAP in post load validation process and also created invalid records report in preload validation process.\n\nInvolved in pre unit testing.\n\nInvolved fixing defects in data string testing and mock testing.\n\nClient : Multi "},{"date_start":"Feb 2011","jobtitle":"Consultant","organization":"Vista","date_end":"Oct 2011","text":"\n\nResponsibilities\/Deliverables:\n\nDeveloped a report for purchase order indent history to display the difference between ordered items and goods received items.\n\nDeveloped a report for purchase request indent history to display the difference between requested items and goods received items.\n\nDeveloped a report to display G\/L account details and called the transaction code from the drill down report.\n\nData migration for material master change using LSMW.\n\nEnhanced the incoterms in sales order creation and change for different customers.\n\n"},{"Experience\/Project":" Work\n\nClient : Welspun\n\nRole : Technical "},{"date_start":"Oct 2014","jobtitle":"Consultant","text":" – Till date.\n\nConfigured the Value mapping for distribution channel in MDG-C.\n\nEnhanced the User Interface for Customer based on the feeder class.\n\nCustomer and Vendor master data uploaded using LSMW and uploaded multiple bank details for Customer and Vendor using BDC.\n\nEnabled the default value for Role in Vendor.\n\nDeveloped a program to activate the mass key mapping for customer in MDG-C.\n\nEnabled the drop down list for account group and company code in MDG-C based on the Business Unit.\n\nConfigured the number range for various account groups in MDG-C and activated the CVI.\n\nEnhanced the class and implemented the BAdi to enable the database search for Material in MDG-M.\n\nEnhanced the Business Partner Data model in MDG-S.\n\nEnabled the field hiding and mandatory for Customer in MDG-C.\n\nImplemented the valid values for various fields in Customer and Vendor UIBB based on\n\nthe Business Unit.\n\nClient : Reliance Industries Ltd\n\nRole : Technical "}]}