{"summary":[{"Company Profile":":- ABV Rock Group is a construction contractor that operates in several interlinked sectors covering buildings and civil works, and acts as a principal and specialist contractor in Oil and Gas\/Ministry of Saudi Arabia etc. Responsibilities. Prepare Weekly Executive Report. Prepare site Manpower and Work progress report. Responsible for receiving, circulating and recording all incoming and outgoing faxes, emails and hand deliveries. Maintain site manager Calendar. Co- ordinate with Client office and site for smooth functioning of work. Weekly Test\/Work Pending report submit to Site Manager. Scanning in all relevant new documents. Create filing and archiving system for documents and distribute technical documents such as Drawing\/Inspection\/Product\/Test Report etc... Uploading documents\/drawings in Electronic systems to store and track communications and log documents. Generate the various document control reports and submit to QA\/QC department. Make sure that controlled copies of latest approved documents and drawings given to the appropriate department. Prepare site HSE weekly report. Implement scanning or other automated data entry procedures, using imaging devices and document imaging software. Prepare and update organization Chart. Handle office stationery, distribute on the basis of the request. Prepare Department Vehicles log sheet and control vehicles. Administration Assistant, National Contracting Co. Ltd. – Saudi Arabia Aramco – YASREF – Project. October 2011 to October 2013. "},{"Company Profile":": - It Providing Mechanical\/Civil engineering services to esteemed organization in Oil\/Gas\/Energy\/Power field. Responsibility’s : - Responding to and putting through (Email\/Phone\/Fax\/Reception) various queries from managers and employees and Client\/Agencies or departments\/Sites. Handle Incoming\/Outgoing documents (Tender & Quotation, Clients Correspondence, and Resumes, drawings, Fax, Emails etc…, registering and distributing the same to the concerned people in various departments. Timely dispatch documents through Courier\/Fax. Assists with the implementation of changes to the filing system when established by supervisory personnel. Provide Secretarial support for the department \/ Division such as schedule and arrange meetings, interviews, appointments, training for managers and supervisors and also coordinating travel as well as lodging arrangements. Maintain updated site manpower list. Handle employee Leave\/End of service and return form leave application. Take approval from management. Purchase monthly stationary and distribute to each departments\/ sites on the basis of site requirement. Prepare LPO\/GRN and sent to Accounts Dept. Schedule & coordinate site Vehicles for smooth functioning of field works. Maintain asset listing & documents of company owned\/Haired equipment and machineries. Ensure, Timely maintenance of equipment’s and office machinery’s. Administration Assistant, Danem Engineering W.L.L – Qatar. Qatar Petroleum - Project February 2010 to February 2011. "},{"Company Profile":": - It Providing Mechanical\/Civil engineering services to esteemed organization in Qatar.(Oil\/Gas) Responsibilities: - Maintain general office filing systems. File and retrieve corporate documents, records and reports. Prepare invoices, reports, memos, letters, financial statements and other documents, using word processing, spreadsheet. Coding Drawing and other technical documents\/ Correspondences. Maintain personnel database in ERP System, Ensure proper maintenance of personal files, service register, Technical documents. Responding to various queries from managers and employees. Prepare Time Sheet Sr. Administration Assistant, ADFC Co.Pvt.Ltd. - India Reliance Oil and Gas Refinery Project. October 2004 to February 2010. "},{"Company Profile":": - It is a ISO 9001:2000 Company, Which Provides Mechanical Engineering \/Construction services to esteemed organization in India. Responsibilities: - Assisting other staff members with maintenance of computer records(ERP –SAP), including accounts data entry and updating e-mail and contact lists; Reception of general telephone enquiries and occasional visitors; taking messages; Co-ordinate with a wide range of government organizations such as PF Office, Labor Commissioner Office, ESIC office, etc. and ensure that all statutory records are maintained.… Opening and sorting the office correspondence and e-mail; stamping, sorting and posting outgoing mail; Maintain files and information on the employees of a company. (These records can include employee names, addresses, salaries, tax information, and benefits.). Notice the Changes information making sure the new information is recorded. Generating and Preparing Employees salary details and sent to Payroll Dept. HR – Dept.:- Inform the applicants that their resumes have been received and letting them know whether they have been hired for the position. Keeping Records of the Applicants. Prepare offer\/Contract letter, assisting joining formalities of new Employees. Preparing weekly\/Monthly MIS reports. Preparation and submission of Daily productivity report of different Departments. Monitoring stocks of stamps, stationery, printed material and supplies; receiving and checking deliveries. General office duties including Copying, collating and dispatching by e-mail and post of committee papers, external customers and internal staff;\n\n\nAchivements\n\nAbility to work Under Pressure\/ handle Team.\n\nWork experience in ERP ( SAP\/ORION) & Tally and Outlook Software.\n\nHow to work with seniors on the complicated matter\n\n\npersonel details\n\nName : Ninesh Varghese.\n\nNationality : Indian\n\nReligion : Christian\n\nMaterial Status : Single\n\nDate of Birth : 30th May 1983\n\nLanguage Known: English, Hindi.\n\n\nPage 4 Ninesh Varghese"}],"education_and_training":[{"Education":"\n\nBachelor of Commerce from Calicut University, March 2003.\n\n\nother qualification\n\nOne Year Diploma Course in Computer Application. MS Office (Word, Excel, Mus.Drs.) Tally 5.4, 6.3, M.S.Access, Ex-Engine, Out Look Express & Internet. Hard ware trouble Shooting\/Programming CC++.Java Typing Speed 45 W.P.M\n\n\n"}],"basics":{"name":{"surname":"Access"},"email":["nineshkv@gmail.com"]},"work_experience":[{"Professional Experience":"\n\n10 Years’ Experience in Clerical\/Secretarial\/Document Controlling field (Engineering\/Construction Industry). "},{"Administrator – Project":" Control, ABV Rock Group Ltd. – Saudi Arabia. Nov 2014 to …. Yasref Aramco Project. "}]}