{"summary":[{"Profile Summary":"\n\nI am an IT Consultant with overall experience of over 9 years and currently contracting for Shell Upstream International Exploration & Production. My main areas of experience has been planning, designing, implementing and delivering IT technology solutions across various industries.\n\nOver the years, I have worked on different industry domains and provided effective solutions to help them achieve better results. I am involved in the process of gathering requirements, understanding the overall scenario and developing strategic solutions while combining elements from business process, organisation and technology.\n\nDuring the tenure of my work, my skills have developed with considerable exposure in consulting, system analysis & design, optimizing, evaluating and controlling the processes and systems. My professional skills in the corporate sector are the witness of quick reception and refinement with the change in the industry to solve key matters with new path breaking ideas and elevated energy level of performance. Overall I am an enthusiastic team player who combines extensive technical, analytical and managerial skills with sound commercial awareness to achieve exceptional business performance. I am capable to work in a team as well as an individual on my own.\n\nProfessional Membership and Certifications\n\nActive Member of British Computer Society [MBCS]\n\nCEng – Chartered Engineering Status application in progress with BCS Expected Nov 2015\n\nBig Data Analytics Certification (Jigsaw Academy- Willey) in progress Expected Jul 2015\n\nCovers:Hadoop, MapReduce, Pig, Hive, Sqoop, Fume, NoSQL.\n\nPRINCE2® Foundation (APMG accredited) "}],"skills":[{"Languages":" known: English, Arabic (basic), Urdu, Hindi, Kannada.\n\nWork Experiences and Achievements\n\n1. EC Technical Project Lead (Shell)\n\nEnergy Components (EC), Excel, EC TagCollector, EC Message, XML and SQL\/PL\n\nConfigure assets (creating\/changing contracts and companies) in Energy components via creating backend scripts. Manage equity share changes and reporting to third end parties.\n\nIdentification and management of technical issues related to Energy Components (EC).\n\nCo-ordination of EC deployments and the related interfaces into the Global environments.\n\nManaged stakeholders and provided solutions that are fit for the organization.\n\nResolve queries received from internal or external sources associated with produced reports.\n\nProvide support to Shell Finance group for reserves and production budget updates.\n\nPreparation and Quality control of data for reporting to management, DECC and other third parties.\n\n"},{"Qualifications":"\n\nMasters Degree in Information Engineering (2005 – 2006) Distinction (first & final semester) The Robert Gordon University, Aberdeen, United Kingdom.\n\nBachelors’ of Engineering in Information Science (2001 – 2005) First Class\n\nSambharam Institute of Technology, Bangalore, India.\n\n"},{"Technical Skills":"\n\nJ2EE, Spring 2.0+, Hibernate 3.0+, Spring MVC, Spring Web Flow, EJB 3, Design Patterns and OO design, JSP 2.0, Servlet 1.4, Jakarta Struts 1.1, JavaServer Faces 1.1, Custom Tags, Apache Tomcat 5+, Perl, Dojo, Annotations, Edig@s standards, Java (JDKs 1.2 to 1.6), C, C++, Visual C++, VBA, .NET;\n\nData Architecture experience - Data Analysis - Data Warehousing - Data Modelling – Data Profiling – Master Data Management - Project Management, ETL and Business Process Mapping.\n\nExploring Big Data technologies, Hadoop, analysis using R, Pig, Hive, Sqoop and Fume etc.\n\nOracle 9i\/10g\/11g, PL\/SQL, MySQL, SQL Server, JDBC, Toad, SQL Developer, NoSQL, MongoDB;\n\nJMS, HTML, DHTML, JavaScript, AJAX\/DWR, JS-OWL, XML, CSS, PHP, XSLT, JBOSS;\n\nEclipse , MyEclispse 5+, Ant, JBuilder, Delta V 9.3, Weka, Biztalk, Photoshop 7.0, SAP, SSIS, SSRS;\n\nSpring MVC Framework, Ant, JUnit, Log4J, Maven, Firestorm, Mantis Bug Tracker, Jasper Report, Altova-Mapforce, (MOSS), Microsoft Sharepoint Services, livelink and Apache POI.\n\nHydrocarbon accounting, Energy Components, EC Messaging, EC TagCollector; SAP;\n\nUnderstanding of Subsurface and Wells Data Management, EDM (Engineer Data Model);\n\nCDS (Corporate Data Store), PowerExplorer, PowerHub, ADT, TaskBuilder (Landmark Halliburton products) , PI, Petrel, Business Objects and SpotFire (TIBCO);\n\nLinux (Red hat), Windows 9X, 2000\/ NT, Windows XP \/ 7, UNIX and Ubuntu;\n\n"}],"basics":{"gender":"male","name":{"firstName":"Jasper","surname":"Report"},"title":"Consultant","email":["ismail@codeoil.com"]},"credibility":[{"References":"\n\nAvailable on Request."}],"work_experience":[{"Project":": UHPS Data migration into Energy Components [EC]\n\nProvided support and plans to get the old production data from UHPS into EC system. This involved mapping of old data model on to new data model and creating a tool to be able to read and generate the old data into new data format sqls that could ensure all the data is accessible in EC after migration.\n\nHelped in providing scope for project charter and designing the solution to fit the best needs of the project. Followed Shell ACR process and standards to ensure the solution gets deployed correctly.\n\nPosition: "},{"date_start":"Oct 2011","organization":"EC","date_end":"Jun 2013","text":"\n\nI was part of Centre of Excellence (CoE) team for Hydrocarbon Accounting E & P. Involved in configuring assets and reporting changes to third end parties. Manage and co-ordinate EC deployments in global environments. Developed reporting solutions and supported EC Messages through BizTalk.\n\nPosition: Cross Disciple Integration Analyst- xDi ("},{"date_start":"Jul 2011","organization":"Shell","date_end":"Sep 2011","text":"\n\nCreated work flows for data management to store data in Corporate Data Store (CDS) and retrieve it efficiently. Configuring third party syncs using PowerHub connections in Java. Gathering information about different data flows in CDS and work towards making data\/work flows much more effective\n\nSystem "},{"date_start":"Aug 2007","jobtitle":"Developer","date_end":"Jul 2011","text":"\n\nI worked with Amor Group at various levels starting as a graduate. My work at Amor Group was under Oil & Gas business unit to develop web based solutions for blue chip companies. Worked with different high level clients to deliver Hydrocarbon Accounting solutions to achieve higher production levels. Salient features of job responsibilities were:\n\nWorked on all aspects of software development; including requirements initiation; design; implementation; testing; documentation; systems development and support.\n\nResponsible for upgrading and providing new solutions to the business; covering front-end and back-end development.\n\nWorked on different Hydro-carbon, LNG and Energy trading systems.\n\nResponsible for taking care of new releases and fix bugs.\n\nReview test plans for better efficiency and validity.\n\nData Exceptions Analyst at Npower Northern Electric, Newcastle, UK Mar 2007 – Jul 2007\n\nWorked for Asset and Energy Data Management (AED) validation team, providing data services to validate data and to meet targeted KPI's.\n\nCritical decision making to sort and optimise data; in order to gain accurate results.\n\n"},{"Applied Project":" Management experience. Experienced in business requirements gathering.\n\nExcellent written and verbal communication skills and strong project delivery skills. \n\nDemonstrated experience in managing complex critical applications with a complex architecture and distributed footprint.\n\nApplied Test Driven Development (TDD) approach for developing projects and gained experience working in agile environment using SCRUM methodologies.\n\nAssigned the tasks of providing proposals to analyse problems as well as created solution designs.\n\nProvide extensive support for some of the above mentioned projects and also managed 24\/7 support rota for specific projects.\n\nGood understanding of ITIL processes.\n\nInvolved in ongoing initiatives to improve processes and establish best practices for maintainability, reliability, scalability and performance of the systems.\n\nProactive attitude with quick learning skills.\n\n"},{"Project":" managing technical staff’s, including prioritization of tasks to ensure deadlines are met.\n\nTest deployments before handing them off to the Global team to release them into Global landscape. Plan implementation of patches ensuring they are properly tested and rolled out.\n\nDeveloped excel spreadsheet uploaders for converting third party production data into EC XML message and configure the processing of EC Message through Biztalk server.\n\nExperienced in handling PI interface for EC TagCollector service, setting up new tags and configuring EC TagCollector.\n\n2. Cross Disciple Integration - xDi (Shell)\n\nCorporate Data Store (CDS), EDM, Power Explorer, ADT and PowerHub, Oracle, SQL\/PL\n\nTested CDS 5000.2.4 version in development environment and deployed it to production. Tested different third party syncs to ensure the data is been populated correctly as expected. Gained experience in configuring Power Hub and ADT connections to transfer data within CDS.\n\nWorked on standardizing third party syncs and work flows to meet Shell standards.\n\nProvide support to resolve well data production issues and other CDS issues.\n\nDocumented different third party syncs\/links in CDS and work flow processes to help in supporting issues efficiently in future.\n\nWork with different metric units to convert and retrieve in different parts of the world based on its regional standards.\n\nHandling Well data types and transferring data using ADT \/ PowerHub to make it available to third party syncs.\n\nGood understanding of Wells and Subsurface data types and handling Corporate Data store (CDS R5000, Landmark Halliburton product ).\n\nConfiguring third party syncs using PowerHub connections in Java.\n\n3. EKB- German based Hydrocarbon Accounting System Server-Side: Java Servlets\/ JSP\/ Dojo web-based front and Spring\/Hibernate back-end. Java Messaging Service (JMS) for sending notifications.\n\nDatabase: Oracle 11g.\n\nGained experience in implementing internationalization, which required the application to be able to handle English and German language text.\n\nGained experience in handling different timezone's for the application (UTC and CET).\n\nImplemented Alarm alerting system within the application for various critical job processes.\n\nDatabase optimization experience with Oracle DBMS and basic experience using data-monitoring tools.\n4. Gastrack Terminal Upgrade – Hydrocarbon Accounting System (BP)\n\nServer-Side: Javascript\/DWR\/JS-OWL\/Spring MVC web-based front and Spring\/Hibernate back-end. Java Messaging Service (JMS) for sending notifications.\n\nDatabase: Oracle 11g.\n\nWorked within the team to develop a new Dimlington terminal integration of OCTIP project, which required to combine three existing complex allocation systems into a single system and to integrate it within the new network.\n\nDeveloped procedures using JAVA API (Apache POI) to generate Microsoft Excel reports using back end data.\n\nWorked on different areas of the system to securely process data, implement calculation procedures and represent it in a user-friendly and customisable front end.\n\nCreated complex SQL and used JDBC connectivity to access the database.\n\n5. Dragon LNG Project Server-Side: Javascript\/JSF\/Spring MVC web-based front and Spring\/Hibernate back-end. Java Messaging Service (JMS) for sending notifications.\n\nDatabase: Oracle 11g.\n\nPlayed a key member of the development team to implement nomination and allocation system for the Dragon LNG terminal.\n\nWorked on different areas of the system to provide functionality including send-in\/send-out forecasting, reports, notifications, inventory and capacity management and secondary trading.\n\nWorked with the team to provide notifications of any system changes through automatic mailing using JMS.\n6. CUPID – Centrica Upstream Project – Hydrocarbon Accounting System (Centrica)\n\nServer-Side: Javascript\/DWR\/Spring MVC web-based front end and Spring\/Hibernate back-end.\n\nDatabase: Oracle 11g.\n\nThe system was designed to collect production data (for client-owned and third-party owned gas fields) from a number of external systems, then validates and converts the data; and provides flexible viewing, editing and reporting of the data.\n\nImplemented a key feature to include a HTML pre-processor using XSLT within the system to read a HTML file, covert it into useful information and store it within the database.\n\nConfigure data tags to read Cumscada input tags and display the provided information in useful and user friendly manner.\n\n7. IRS – Incident Reporting System (BP) Server-Side: Java Servlets\/ JSP web-based front and EJB\/Firestorm back-end.\n\nDatabase: Oracle 10g.\n\nRe-designed full life cycle development of RT-IRSTM application and modified the existing application to add new components and features; emphasizing maintainability, reliability, scalability and performance.\n\nInstalled IRS application and conducted Site Acceptance Testing (SAT) at clients site. Also documented Acceptance Testing System (ATS) and training for the client.\n\nImplemented notification service to send out email’s whenever there is a new event or incident updates done by the user.\n\n8. EBB- Environmental Bulletin Board (Centrica) Server-Side: Java Servlets\/ JSP web-based front and Spring\/Hibernate back-end.\n\nWorked towards extending and adding more features for the client on the basic bulletin board.\n\nDeveloped reporting services to allow customers to send out information about environmental usage of the company.\n\n9. GCS3 – Upgrade (HRL - British Gas) Server-Side: C, C++, and Visual basic 6 for front end.\n\nIndividually developed a standalone application to read tag data from an external hardware RNI device and implemented a user interface to view tag data.\n\nThe interface also included features to add, modify, and delete tags for the received RNI Data.\n10. DCS Rivers Graphics and Oxy Halul Graphics Project (British Gas)\n\nEnvironment: Delta V 9.3, Sub Version Control and Mantis bug tracking\n\nReconstructed old graphics to new structured and well organized graphics. Revamping dynamos with clear defined dynamos that will make the operator to analyze critical alarms within short time.\n\nDeveloped skills in creating user friendly graphics and dynamos using Delta V 9.3 software.\n\nWorked onsite on client site to ensure working of graphics in real time and making changes to client satisfaction.\n\n"},{"date_start":"2013","organization":"Logica","text":" (now CGI), Aberdeen, UK 2012\n\n"},{"Professional Experience":"\n\nIT "},{"date_start":"Jul 2011","jobtitle":"Consultant","organization":"Royal Dutch Shell","text":" Plc (Upstream International Exploration & production)\n\nCurrent Position: - Senior Business Analyst ["},{"date_start":"Jul 2013","organization":"Shell","text":"\n\nI am currently part of Technical Data Management [TDM] and Global Data Quality Management team for Shell Upstream E&P. My current work involves high level of client interaction, technical consultancy, design, data management, documentation, work flow and data processing strategies. Salient features of my current job responsibilities and different projects involved:\n\n"},{"Project":": Data Quality Management [Project Implemenation and Delivery]\n\nIdentification and management of Data Quality (DQ) issues related to production data in Energy Components. Explore Big Data technologies and apply data science analytics to help improve ever growing E&P data across different disciplines\n\nHelped establishing business rules to more than 12 Shell operated Countries that could measure Data Quality between different data sources such as Corporate Data Store (CDS), EDM and EC etc.\n\nImproved data quality by approx. 30% in the last 6 months across all global assets with predefined business rules across different systems like EDM, EC, CDS, Recall, OpenWorks,Petrel, Siesta and Oil Field Manager. Highlighting issues using production dashboard also helped improve production data.\n\nProvide analysis to Upstream Production Business to make better decisions with the help of accurate production data from EC. Helped in building the Well Capacity Plot tool to reflect the actual and potential production capacity of the well.\n\nSupport global data management system which covers more than 23 focus assets and help build workflows to maintain and manage data management issues. Business process mapping and stakeholder management services.\n\n"},{"Project":": Data Atlas\n\nRole as the Enterprise Data Architect [EDA] to guide integration, drive quality enhancement, and successful data delivery for Shell Technical Data standard, documents and business rules.\n\nLead Architect in Designing Comprehensive Data warehouse Solution, from data to presentation layer. Helped building sustainable solution that provides one stop shop of all technical data standards, standard procedures, documents and custom views that will be adaptable globally across 20+ countries.\n\nManaged to meet business requirement challenges within the estimated time frame. Successfully complemented implementing the project within the budget.\n\n"}]}