{"summary":[{"Experience Summary":":\n\n• 7 years of experience in application development using Java, J2EE, Spring, Struts, Hibernate, Hadoop, JDBC, JMS, JSP, Servlets, XML, Glassfish, JBoss, Tomcat.\n\n• Proficient in database development: Oracle, MYSQL, SQL.\n\n• Experienced in Software development and business modeling of Web applications, Client\/Server systems, Distributed Applications and other custom-built projects.\n\n• Strong in Object - oriented design\/analysis, UML modeling, Classic design patterns, J2EE patterns.\n\n• Strong Web development skills. "}],"education_and_training":[{"Training and Certifications":"\n\n??Sun Certified Java professional\n\n??Enterprise Integration with Spring training.\n\n??ICAgile Agile Training for Executives\n\n??"},{"Cloudera Training":" for Apache Hadoop\n\n"}],"skills":[{"Programming Languages":" : Java - J2EE: Servlets, JDBC, JMS, ESB\n\nFramework : Spring, Struts, Quartz, EHCACHE, Mule, REST , SOAP\n\nO\/R Persistence : Hibernate JPA\n\nHadoop\/Big Data : HDFS, MapReduce, HBase, Pig, Hive, Sqoop, Cloudera CDH\n\n"},{"Web Technologies":" : JSF, Vaadin, JSP, AJAX, HTML, Java Script, jQuery, CSS\n\nPortlets : JSR 168, 286, Spring MVC portlet, Liferay portal, weblogic\n\nDatabase : Oracle, MYSQL\n\nBPM : jBPM, Drools rule engine\n\nServers : Jboss, Glassfish, Weblogic and Tomcat\n\nTests : Junit, Jmock, Power Mock, Twist test\n\nDevelopment Tool : Eclipse, IntelliJ, Toad Query Analyzer, Mysql query browser.\n\nTools : CVS, SVN, IBM RTC, Maven, Sonar, Teamcity, Jekins, Mingle\n\nOperating Systems : Windows 9x\/2000\/XP\/2003\/7, UNIX, Solaris\n\n"},{"Zanec Technologies":"\n\nChennai, India\n\n"}],"basics":{"gender":"male","phone":["966 4357110"],"name":{"firstName":"Al","surname":"Elm"},"email":["amy.yusoof@gmail.com"]},"work_experience":[{"Experience":" in N-tier Client-Server based Internet technology, intranet portal design\/development; Web based data reporting system.\n\n• Thorough knowledge with J2EE application platform configuration and performance optimization. Hands on experience with J2EE application deployment technology\n\n• Capable of doing quick prototypes for analyzing the feasibility of Design\/Architecture.\n\n• Experience in leading and managing teams. Handling customers and vendors.\n\n• Flexible in working different project models like Agile, XP, TDD and Waterfall model.\n\n• Hands on experience on different verticals such as eGovernment, Financial, Telecom and Social networking.\n\n• Good knowledge of PHP, JavaScript, HTML, DHTML, XML, CSS\n\n• Have excellent communication skills, work ethics and the ability to work well in a team or individual environment.\n\nTechnical Exposure:\n\n"},{"Work Experience":"\n\nAl-Elm Information Security Company\n\nRiyadh, KSA\n\nSenior Solutions "},{"date_start":"May 2013","jobtitle":"Developer","text":" – Till Date\n\nEJAR (Ministry of Housing, KSA)\n\nEJAR is an advanced electronic platform that provides complete integrated solutions for the commercial housing sector, and an ecosystem on which all the parties involved in this sector can exist and interact. EJAR service facilitates the process of looking for a housing unit or displaying a housing unit as an original party or as a mediator, which leads to the construction of a very advanced database that is able to add value every time it is used to all parties. In addition this network regulates the relationship between all concerned parties and preserves their rights due to the very high technical standards that characterize EJAR, and the way information is stored and displayed for use in a simple and valuable manner.\n\n* Responsible for Analysis, Design and Development\n\n* Interact with customers, business analysts and other stake holders in the project.\n\n* Responsible for project plans, task deliverables, with high levels of quality.\n\n* Analyzing and making appropriate recommendations on technical design tasks such as integration with external applications.\n\n* Develop and present insightful assessments, analysis and deliverables to stakeholders.\n\n* Responsible for problem identification, system architecture definition, hardware\/software specification and\/or design, implementation, testing.\n\n* Responsible for reviewing the peer code review and fixing code violations reported by automated tools such as Sonar.\n\n* Involved in developing web portal using Liferay portal.\n\n* Integrating billing system Oracle BRMS with the portal using middleware web services.\n\n* Developed search engine for the application data using solar.\n\n* Writing Unit tests using Junit and Mock frameworks, automated functional test using Selenium tests.\n\nTechnology: Java, J2EE, Spring, JMS, Rest API, Liferay, Hibernate JPA, JNDI, tomcat, Ms-SQL, Oracle BRMS, Primefaces JSF, Junit, Maven, Sonar\n\nQatar Financial Centre Authority (Qatarlyst S.P.C Ltd) Doha, Qatar\n\nJava "},{"date_start":"Nov 2011","jobtitle":"Developer","date_end":"December 2012","text":"\n\nQatarlyst Insurance Trading Platform (QFCA, Qatar\/ Qatarlyst UK)\n\nQatarlyst is a new solution which has been developed by the Qatar Financial Centre Authority (QFC Authority) in conjunction with regional industry leaders. Qatarlyst offers all the processes required from both a placing and quoting perspective through to binding. This includes the ability to offer insurance contracts to a selected group of (re)insurers with structured data, negotiation on those offers, decline or acceptance of the offer, submission and agreement of endorsement or cancellations to bound quotes and contracts.\n\n* Responsible for Analysis, Design and Development of Qatarlyst Insurance Trading Platform.\n\n* Responsible for project plans, task deliverables, with high levels of quality.\n\n* Analyzing and making appropriate recommendations on business alignment, change management, change readiness, and the implementation of client strategies and processes.\n\n* Responsible for reviewing, investigating, evaluating, and selecting new technologies for new qatarlyst platform.\n\n* Developed the messaging adapters to be used with Mule ESB for communication between different components.\n\n* Developed services based on REST\n\n* Involved developing business process and rules using drools.\n\n* Writing Unit tests using Junit and Mock frameworks, automated functional test using Twist tests.\n\nTechnology: Java, J2EE, Liferay, Spring, JMS, ESB Mule, Rest API, Drools, Hibernate JPA, Java Concurrency, JNDI, XML\/HTTP, weblogic, Oracle, Junit, Maven, jekins\n\nEricsson India Global Services Pvt. Ltd.\n\nChennai, India\n\n"},{"date_start":"July 2010","jobtitle":"Software Engineer","organization":"Ericsson","date_end":"Oct 2011","text":" has proposed a Charging Gateway Solution to Bharti Airtel to meet the unified charging requirement of VAS services for its prepaid subscribers. The Charging Gateway helps Bharti Airtel to have a centralized rating management of all the deployed VAS and Content Applications. Ericsson Multi Mediation was used as a common charging gateway for this solution.\n\n* Perform multiple roles as software engineer building extensible, robust, maintainable systems participating in all stages of Software development life cycle\n\n* Work with project sponsors to create Vision\/Scope document\n\n* Translate requirements from non-technical end users through interviews into documents understandable by users and developers- Process flow diagrams, Functional specifications with use cases and class models, sequence diagrams using tools\n\n* Develop and deliver application through various phases.\n\n* Involved in NIT (Network Integration Test), and UAT with Customer.\n\n* Manage client expectations leading to client satisfaction and retention\n\n* Quickly analyze new business processes and perform business process re-engineering\n\n* Worked in product and custom application development\n\n*  Involved in developing Mapreduce jobs.\n\n*  Involved in start to end process of hadoop cluster setup where in installation, configuration and monitoring the Hadoop Cluster using Cloudera CDH. \n\n* Responsible for Cluster maintenance, commissioning and decommissioning Data nodes, Cluster Monitoring, Troubleshooting, Manage and review data backups, Manage & review Hadoop log files. \n\n* Monitoring systems and services, architecture design and implementation of hadoop deployment, configuration management, backup, and disaster recovery systems and procedures. \n\n* Configured various property files like core-site.xml, hdfs-site.xml, mapred-site.xml based upon the job requirement \n\n* Worked in multi site distributed work environments\n\n* Developed the XSD’s to share the common format for XML between renewal settlement and VAS vendors, and renewal and settlement and multi mediation.\n\n* Used JMS messaging services for asynchronous transactions for renewal and provisioning.\n\n* Developed XML utilities for marshalling and un-marshalling xml objects using JAXB API.\n\n* Used JSF to make application Web-centric and followed the MVC modular architecture for the application.\n\n* Developed GUI using JSP, JSTL tags.\n\nTechnology: Java, J2EE, Spring, Spring MVC, JSP, JMS, REST, Hadoop HDFS, Mapreduce, Hive, Sqoop, Quartz Scheduling API, JDBC, Java Concurrency, JNDI, XML\/HTTP, Glassfish, Ant\n\n"},{"date_start":"Apr 2010","jobtitle":"Software Engineer","organization":"IBM","date_end":"Jul 2010","text":"\n\nGlobal Integrated Order Manager (AT&T, USA)\n\nGIOM Global Integrated Order Manager AT&T is providing multiple Business Tele Communication Services to the customer. The services like Switched Voice Data Local Network and CALNET for this Services AT&T provided a Common web portal GIOM. The Global Integrated Order Manager (GIOM) is intended to provide a common user portal to all AT&T Business Services service-specific order infrastructures (Data and Local Voice) to facilitate customer-centric orders of both standalone and bundled services. GIOM provides the capability to place both the Express (Flow through) and the partial (Flow-to) orders.\n\n* Involved in Up-gradation of JDK1.4 to JDK1.6\n\n* Developed the Front End and Middle Tier of Project.\n\n* Developed web pages using JSP, JSTL tags\n\n* Providing support during System Test UAT phases by fixing the bugs in the code Delivered.\n\n* Used SQL Queries at the back end.\n\n* Used JDBC driver to connect to the MYSQL database for all data transactions.\n\nTechnology: Java, J2EE, Hibernate, JDBC, Servlets, JSP, Jboss, Java Script, Oracle, HTML tags.\n\n"},{"date_start":"Nov 2009","jobtitle":"Software Engineer","date_end":"Feb 2010","text":"\n\nHealthCare Social Network (Zanec Technologies, UK)\n\nHealth Network is a health based social network of people sharing their disease experiences, treatment options, knowledge and giving support to other people suffering from similar health problems. And also it connects Doctors, Pharmacists, Patients, and Diagnostic centers in a single network to discuss and collaborate.\n\n* Developed portlets using Liferay portal Web UI for the application.\n\n* Responsible for writing the Action servlet for every action as part of the struts framework.\n\n* Developed Action form for capturing the values from the front end.\n\n* The front end of the application was been developed using JSP with JSTL and Bean tags.\n\n* Used Spring IOC to develop the Spring Configuration files.\n\n* Used dependency injection in business layer.\n\n* Wrote Entity classes for Data tables using annotations.\n\n* Used Hibernate Query Language in Data Access Layer.\n\nTechnology: Java, J2EE, Struts, Spring, Spring MVC, Hibernate, liferay portal, JPA, JDBC, Servlets, JSP, Java Script Oracle, JSTL, Bean tags, HTML tags, AJAX.\n\nWisdom Infotech Pvt Ltd\n\nChennai, India\n\n"},{"date_start":"March 2008","jobtitle":"Software Engineer","date_end":"Nov 2009","text":".\n\nEnterprise Social Network (Sparta Social Network, USA)\n\nSparta Social Network Community features provide a rich user experience and ease of administration, while it’s underlying Community core and flexible architecture enables to develop and deploy cutting-edge features to meet ever-evolving requirements. Features like creating group, inviting friends, writing forum, managing events, uploading photo, video, creating blog are incorporated in Sparta.\n\n* Struts and Spring were used to make the application Web-centric and followed the MVC modular architecture for the application.\n\n* Developed portlets using Liferay portal Web UI for the application.\n\n* Responsible for developing and maintaining the application.\n\n* Responsible for writing the Action servlet for every action as part of the struts framework.\n\n* Developed Action form for capturing the values from the front end.\n\n* The front end of the application was been developed using JSP with JSTL and Bean tags.\n\n* Involved in JavaScript coding for validations and passing attributes from one screen to another.\n\n* Developed the Struts-Config file for the application using XML.\n\n* Used Spring IOC to develop the Spring Configuration files.\n\n* Developed Spring DAO in the data Layer.\n\n* Developed Business Service for Storing and Retrieving the data from the Data layer.\n\n* Wrote Entity classes for Data tables using annotations.\n\n* Used Hibernate Query Language in Data Access Layer.\n\n* Used JBoss Application server for the application.\n\n* Integrating application with Facebook, Linkedin, twitter, flickr\n\n* Analyzed and worked on the HTML prototype mock-ups for various screens in the application and also prepared the HTML prototype Documentation of the application and submitted to the Business Stake holders.\n\nTechnology: Java, J2EE, Struts, Spring, Spring MVC, Liferay portal, Hibernate JPA, JDBC, Servlets, JSP, Java Script, Oracle, JSTL, Bean tags, HTML tags, AJAX, Jboss, Maven.\n\nAcademic Qualification:\n\n??[2004-2007] B.E Computer Science and Engineering (74%)\n\nAnna University\n\n??[2000-2003] Diploma in Computer Technology (76%) Vel Tech Polytechnic, Directorate of Technical Education."}]}