{"summary":[{"HIGHLIGHTS":" llll Advance MS Office Suite ? Strong interpersonal Excel spreadsheets ? Employee relations Meticulous attention to details ? Organisational skills Results-oriented ? Business Writing Time Management\n\nPROFESSIONAL l EXPERIENCE l\n\nHR & PR OFFICER - SPECIALIST SERVICES GROUP (www.specserve.com) ABU DHABI \/ DUBAI, U.A.E.\n\nProviding people and equipment in Oil & Gas. [Engineering Procurement Construction (EPC), Drilling Testing and Production (DTP), Modular Buildings and Hire]\n\nTotal number of staff: 360 plus; Total number of yard workers: 900 plus Reporting to HR "}],"education_and_training":[{"EDUCATION":" l\n\nUNIVERSITY OF CALICUT, KERALA, INDIA BACHELOR OF COMMERCE\n\nREFERENCE l Available upon request.\n"}],"basics":{"phone":["050-7420874"],"name":{"surname":"Manager"},"email":["get2najee@gmail.com"]},"awards":[{"ACCOMPLISHMENTS":" l\n\n• More than 12 years of administrative experience. • Increase office organization by developing more efficient filing system. • Coordinated all department functions for team of 1000 plus employees.\n\nTRAININGS l • Customer Service Skills • MS Excel 2010 Beyond Basics • Email and Telephone Etiquette • Buddy System\n\nSOFWARE l AND SYSTEM l PROFICIENCY l\n\n• MS Office (Word, PowerPoint, Excel, Outlook) • Adobe Acrobat \/ PDF • Microsoft AX Dynamics – ERP System\n\n"}],"work_experience":[{"date_start":"02.2014","organization":"Microsoft","text":"\n\n1 Pe\n\nNAJEEB ASANAPATH ADMINISTRATOR \/ EXECUTIVE \/ BUSINESS SUPPORT Sharjah, United Arab Emirates | get2najee@gmail.com | 050-7420874\n\nWith more than 12 years progressive experience in business support and administration, dedicated, focused who excels at prioritizing, completing multiple tasks simultaneously and following through to achieve goals. Seeking a role of increased responsibility and authority.\n\n"},{"date_start":"SEPTEMBER 2001","jobtitle":"Manager","text":" – PRESENT\n\n• Arranging Security Passes (CICPA) Offshore \/ Onshore • Typing Security Pass \/ Optima card application. • Arrange and coordinate Offshore \/ Onshore medical & Trainings • Preparation of ADMA \/ ZADCO Optima \/ Travel Cards • Organize Safety \/ HSE Induction ADMA & ZADCO • Process Work Permit, Entry Permit, Visa, and Labour Card, Emirates ID\n\nrenewal \/ Stamping \/ Cancellation. • Ensure filing and archiving is done accurately both electronically and\n\nmanually and is easily retrievable while complying with confidentiality norms.\n\n• Arranging the induction of staff and providing information on conditions of service, salary advance\n\n• Arrange and coordinate trainings for staff; update training registers; update training budget and expenses incur on a monthly basis.\n\n• Update new employee status, department, position and reporting structure in Synergy.\n\n• Providing secretarial, clerical and administrative support to HR department. • Supervise office boys and Liaises with camp boss for Labour accommodation\n\nissues. • Negotiating & setting disputes with the employees, maintaining discipline and\n\nharmonious working environment across all employees’ levels.\n\n2 Pe\n\n"}]}