{"summary":[{"Objective":":\n\nIntend to build a career with leading corporate of the Hi-Tech environment with committed and dedicated people, which will help me to explore my diversities fully and realize my potential. Willing to work as a key player in the challenging and creative environment.\n\nBrief Overview\n\nHaving over 9+ years of experience in Finance & Accounts in a computerized environment. Well experienced in maintenance and finalization of financial accounts and reconciliations. Excellent communication & relationship management skills with accurate numerical abilities.\n\nSuccessfully handled Oracle General accounting process for 5 critical countries.\n\n"},{"Company Profile":" Manufacturing & Processing of Steel & Aluminum & Building materials. ( ALUBOND).\n\nPosition Accountant\n\nERP Application RAMCO WIRTUAL WORKS (ERP).\n\nPERIOD: 09-MAY-10 to 14-JUN-10\n\nJob Roles & Responsibilities:\n\nAccounts Payable functions (End to End Process):\n\nAuthorization of Supplier Direct & Order Based invoice.\n\nAuthorization of Supplier Debit & Credit Note.\n\nSupplier Payment.\n\nSupplier Sundry Payment & Release payment (cheque, Bank transfer & LC).\n\nSupplier Balance Transfer.\n\nSupplier Balance adjustments.\n\nVendor Prepayments & Vendor setup in the database.\n\nSupplier Suspense Account response.\n\nValidation of Bank charges & their standing instructions.\n\nMonthly Vehicle loan payments.\n\nDiscounting of checks.\n\n3.\n\nOrganization : IBM Daksh Business process Services\n\n"},{"Company Profile":" : Consulting, Technology and Outsourcing\n\nPosition : Team Lead\n\nERP Application : SAP 7.1.0 (Procurement)\n\nPeriod : 26-Nov-2009 to 30-Apr-2010\n\nJob Roles & Responsibilities:\n\nGlobal Accounts Payables functions (End to End Process):\n\nIPVN (Invoice payment verification notification).\n\nSIGVER (Signature Verification).\n\nAPUEFT mail Notifications (Accounts Payable Utility Electronic Fund Transfers).\n\nBlocks Removal Audit.(Invoice Blocks & Vendor Blocks)\n\nNon – Receivables Audit.( IR & GR)\n\nHigh $ notifications.\n\nSecond Authorized Approver Notification.\n\nSample Quality Audit.\n\nAged RTV (Return to Vendor) report.\n\nManagement Summery report.\n\nReconciliation of Paper Invoice in Content Manager.\n\nValidating & approving IBM’s Utility request & invoices.\n\nAPU Administrator.\n\nFinancial Reporting:\n\nInvolve in periodical\/quarterly risk reviews, of the potential Procurement items affecting the financial position of the IBM.\n\nSpread of material to update performance metrics, and treatment through BDW, Web Intelligence tool and W3 for all IBM Procurement related Activities.\n\nDependable for developing and on condition that functional and operational reports to administrative management that provides essential information for management to do their individual analysis above customary intelligence.\n\nAdditional Responsibilities :\n\nHandling a Team of 8 members.\n\nConducting Daily team huddle & Team meetings for the effective work.\n\nDemonstrate managerial skills, problem solving techniques when required.\n\nAssisting team members whenever they are in need.\n\n4.\n\nOrganization Accenture Services Pvt. Limited.\n\n"},{"Company Profile":" Consulting, Technology and Outsourcing\n\nPosition Senior Process Associate\n\nERP Application Oracle 11i, 11 and 10.7 Financials (AP Module)\n\nPeriod: 24-May-2007 to 24-Nov-2009\n\nJob Roles & Responsibilities:\n\nAccounts Payable functions (End to End Process):\n\nResponsible and accountable for processing, Quality Check of invoices.\n\nTo have a robust check on basic invoice details, PO details and entity details etc., before processing and at Quality check as well .\n\nEnsuring all invoices processed with proper approval in place. Monitoring backlogs and ready to handle Volumes.\n\nLiaising with cross functional teams on query resolution, process and system improvements.\n\nResponsible to adhere SOX compliance.\n\nKnowledge on Scanning and work-flow solutions.\n\nEnsure real time QC and document the errors noticed and resolution given .\n\nPerforms functions associated with monthly financial closing.\n\nProcess supplier invoices from an electronic scanning\/workflow tool in a timely manner.\n\nProcess direct debits\/standing orders (or equivalents) and associated tasks.\n\nLiase with requisitioners \/ approvers to process Purchase Orders.\n\nLiase with internal Claims,Sourcing staff and some external customers, brokers, claimants, etc. to process technical payments.\n\nReconcile supplier statements.\n\nControl outstanding position of aged creditors report.\n\nLiaise with internal staff \/ banks to ensure the correct details are held on various systems.\n\nCheck accounts payable proposed payments and run payments runs Handle, or control, balance sheet reconciliation processes associated with Accounts Payable, Travel & Entertaining and Payments & Receipts\n\nPayment batch and travel expenses processing, of payable invoices\n\nAP Disbursements and CFS (Citibank Financial Services) tracking\n\nInvoice scanning and processing with 100% accuracy\n\nWorking on vendor maintenance process and week-end activities\n\nMonth-end processing, and closure of AP under Oracle 11i and non-11i\n\nAct as a Subject Matter Expert (SME)\/Super-user for the process and help other team members with the complex situations and queries\n\nHandle and resolve process related Escalations, and take necessary steps to prevent their occurrence in the future\n\nTo manage Direct-debit process (ECS, in India), and following up on the open Bank Reconciliation Statement items. Review and validate the Prepayments\/Urgent payment Requests, and instruct the RTC (Regional Treasury Center) to request bank to disburse payment.\n\nFinancial Reporting:\n\nInvolve in monthly\/quarterly risk reviews, of the potential balance sheet items affecting the financial position of the client\n\nCollation of material to update performance metrics, and reporting through EDW Web Intelligence tool and SQL, as per Clientele Service Level Agreement\n\nResponsible for creating and providing functional and operational reports to executive management, that provides essential information for managers to do their own analysis above standard reports\n\nPartnering:\n\nShowcase capabilities to prospective clients\n\nLiaise with internal departments like Treasury in finding out status of invoices\n\nOutbound interfaces (e.g., General Ledger, IC, AR, Fixed Assets).\n\nWork closely with the team lead and support the team during crisis or additional workload\n\nAdditional Responsibilities :\n\nEnsuring timely delivery of service deliverables\n\nEnsure compliance with Client’s policies and practices\n\nDemonstrate managerial skills, problem solving techniques when required.\n\n"},{"Company Profile":" Tyre retarding & new tyres distributors\n\nPosition Accountant.\n\nPeriod 12-04-2004 to 10-10-2005\n\nJob Roles & Responsibilities:\n\nMaintenance of books of accounts.\n\nPreparation of financial statements for tax audit.\n\nSupporting sales & marketing areas.\n\n"}],"education_and_training":[{"Educational Background":"\n\nCompleted MBA from Visvesaraiah technological university Belgaum in the year 2007 with 1st class\n\nCompleted B.Com From Kuvempu University in the Year April 2004 with 1st Class.\n\n"}],"skills":[{"Technical Skills":"\n\nOffice 2000 (M S Word, M S Excel, M S Access)\n\nOracle R12,11i , 11 and 10.7 (AP Module,Cash Management, AR Module & General Ledger, Consolidation)\n\nAssure net & Black line for Reconciliation. SAP 7.1.0 (AP & Procurement)\n\n"},{"Languages":" Known : Kannada, English,Hindi & Urdu\n\nVisa Status : Tourist\n\nLocal Contact : 050 6915645\/0505712034\n\nPlace: Ras Al Khaimah\n\nDate: ARIF SARDAR\n"}],"basics":{"gender":"male","name":{"firstName":"Al","surname":"Khaimah"},"email":["arifsardar@gmail.com"]},"extracurricular":[{"Intercompany Activities":":\n\nAccounting of Intercompany receivable and payables transactions through Interco module. (Mainly EMC\/Pivotal Cross charges and settlements on a quarterly basis)\n\nTaking care of Intercompany settlements on a quarterly basis.\n\nPreparation of Intercompany Reconciliations on monthly basis.\n\nTravel & Expense Activities:\n\nRunning T&E reports from Discoverer for All the Corporate Credit Card Transactions.\n\nEligible, In process, Post AP and Citi unpaid transactions after AP gets closed for the month before month end.\n\nAll credit Card Transactions on Day 1 to accrue all the transactions after AP close date to till last day of the month & providing all these details to FP&A to evaluate these information as per the Cost center as well as with the Country.\n\nPreparing Global monthly recon for T&E as per the reports & with other T&E details booked to T&E Accrual Account.\n\n2.\n\nOrganization Mulk Holdings FZC (UNITED ARAB EMIARTES)\n\n"},{"Professional Activities":" and Achievements\n\nBeen with “Spot Award” Twice for delivering over 100% efficiency.\n\nRewarded with “Summit Award” for kind service delivery.\n\nRewarded with Good Samaritan award for Teach & team.\n\nRewarded with ‘Instant Awards’ and a Certificate of Appreciation by clients for the quality of work and quick response.\n\nRewarded with a Certificate from Service Delivery Lead (SDL) for my consistent top performance.\n\nReceived Appreciation note from the GPO (Global Process Owner) for the great achievement in Accounts Payable & its allied activities.\n\n5.\n\nOrganization PRABHATH TYRES\n\n"}],"work_experience":[{"Professional Experience":"\n\n1.\n\nVMware software India Private limited.\n\nPosition: General Ledger Accountant\n\nPeriod: 24-Nov-2010 to till date.\n\nVMware is the global leader in cloud infrastructure delivers customer-proven virtualization solutions that significantly reduce IT complexity. VMware accelerates an organization’s transition to cloud computing, while preserving existing IT investments and enabling more efficient, agile service delivery without compromising control. Organizations rely on VMware, its partners and its industry-leading virtual infrastructure platform.\n\nGeneral Ledger Activities:\n\nMaintenance of sub-ledgers to General Ledger and General Ledger. Sub-ledgers like fixed assets & Cash.\n\nReview of AP analysis on a weekly basis and informing AP to book to the correct account if it has coded to wrong account.\n\nChecking the availability of funds in bank accounts. Requesting Treasury team to transfer the required funds to bank if any shortage of funds to pay to Vendors.\n\nAccounting of Intercompany receivable and payables transactions through Interco module.\n\nTaking care of Intercompany settlements for the EMEA Region on a monthly basis.\n\nBooking the ESPP & VAT restatements in Sub’s books.\n\nRelease of Prepaid expenses as per the corporate policy.\n\nAccounting of Corp Bonus, MBO Bonus and Commission accruals.\n\nBooking the Budget Manager Marketing and legal accruals as per the data provided by the Budget manager and cross check that whether this has already invoiced by AP to avoid the duplication.\n\nAccruing for Outstanding invoices through Utility accruals - for which the services has already rendered by the vendor.\n\nAccounting of Gelco accruals and the Gelco Provision (Gelco is a tool where VMware employee’s are to claim their employee expenses.\n\nCreating a provision on bad debts based on AR aging bucket.\n\nBooking Headcount and Recruitment journals and allocation of expense & recruitment through running Mass allocation.\n\nRunning Revaluation and Translation.\n\nBooking EMC Cross charges and settlements on a quarterly basis.\n\nBooking Marketing and R&D revenue after doing the Cost-plus calculations and approved by the Manager.\n\nTaking care of Balance sheet reconciliations like – Prepaid, VAT, Commissions, Gelco, Accrued liabilities, Bank accounts, Retained earnings, Security deposits, Intercompany Receivable and Payable etc.\n\nAnalysis and explanation of variances of Income, Expenses & Balance sheet accounts on a monthly, quarterly & yearly basis.\n\nStatutory compliance - Liaise with the respective local country consulting teams to file VAT returns on a monthly basis ,corporate income tax returns, follow-up to get the VAT refund and Support statutory audits at regional level by preparing requested schedules and reconciliations.\n\nCash Management Activities:\n\nDownloading the bank statement and updating day to day payments into the cash management.\n\nReconciling the AP Payments lines with the Bank statements as well as with Cash Apps receipts with the Manual & Batch reconciliation for Customer receipts.\n\nBooking the journal’s in GL to reconcile the payments which has not paid through the AP .Example direct debits and Payroll payments etc.\n\n"}],"misc":[{"Strengths":"\n\nCommunication and problem solving skills.\n\nLeadership ability.\n\nAbility to adapt any work Environment and Time oriented etc.\n\nSelf Motivation, etc.\n\nPersonal Information:\nName : ARIF SARDAR\nFather’s Name : SARDAR SHABULAL\nDate of Birth : 31 Jan 1983\nGender : Male\nMarital Status : Single\nNationality : Indian\nReligion : Islam\n"}]}