{"summary":[{"EXECUTIVE SUMMARY":"\n\nSenior Internal Auditor and Associate member of Charted Certified Accountants (ACCA) with 7 years of experience gained from reputed organizations including Deloitte (Big4) in internal auditing, evaluation of internal controls, financial analysis and accounting. Key strengths include: performing risk based internal audit and consultancy assignments; developing the controls systems including business manuals, policies and procedures; highlighting internal control weaknesses; presenting audit findings in concise written reports; an ability to gather, analyze and evaluate facts related to different financial processes and cultures adopted by organizations; adaptable and proactive team player with strong financial, analytical, communication and leadership skills.\n\nSPECIALITIES\n\nRisk based Internal Auditing\n\nEvaluation of Internal Controls\n\nRisk Assessment\n\nFinancial Analysis\n\nAccounting and Finance\n\nEntity Level Internal Control Review\n\nBusiness Process Improvements\n\nMonitoring Compliance\n\nCorporate Governance\n\nSystem Review\n\n"},{"CAREER HIGHLIGHTS":"\n\nIn 2013, got an opportunity to work for Danube being number one building material company (in the Middle East). Entrusted with the responsibility to perform internal audit assignments for the group including mall based outlets and food chain cafes. As an internal auditor, reviewed documents and process to highlight areas of concern to management; conducted analysis on various areas and suggested improvements.\n\nIn "}],"skills":[{"Nationality: Pakistani\n\nLanguages":" Known: English and Urdu.\n\nDriving License: Valid U.A.E Driving license\n\nPage 1 of 1\n\nPage 3 of 3"}],"basics":{"gender":"male","name":{"firstName":"Muhammad","surname":"Arsalan"},"email":["m.arsalan@live.com"]},"extracurricular":[{"EXTRACURRICULAR ACTIVITIES":"\n\nCricket, Swimming, Travelling and Socializing with friends & family.\n\nPERSONAL DETAILS\n\nDate of Birth: 6th September, 1985\n\nMarital Status: Single\n\n"}],"work_experience":[{"date_start":"2011","jobtitle":"Manager","text":" Internal Audit and performed internal audit assignments for various departments at Head Office and Regional Offices. The departments included Finance, Credit Control, Company Secretary, Marketing, Treasury, Human Resource and Compliance.\n\nStarted my professional career in 2007 by working for one of the Big 4 audit firm (Deloitte) and conducted risk based internal audit and consultancy assignments for various financial institutions and manufacturing concerns. The experience has brought an extensive growth in my expertise not only as an auditor but also as an accounting and financial professional.\n\n"},{"PROFESSIONAL WORK EXPERIENCE":"\n\nMay 2013 to present (2 years)\n\nInternal Audit Department of Al Danube Building Materials FZCO (Dubai, UAE)\n\nSenior Executive Internal Audit\n\nPerformed internal audit assignments for different segments of the group comprised of Building Material Company, Mall based outlets and Food chain cafes. Key roles and responsibilities included:\n\nDeveloping audit objectives and meet with department heads to identify relevant controls and related risks.\n\nDeveloping detailed work plan for the execution of audit procedures on the basis of risk assessment and process understanding prevailing in business functions and branches located in UAE (all emirates states).\n\nExecuting internal audit assignments for all departments and branches in accordance with ISA and professional standards of the group.\n\nContributing to design company’s policies and procedures and ensuring compliance with the same. This includes in depth coverage of on field operations, identifying control weakness and coming up with strategies and procedures to cover up these weakness.\n\nInitiate, monitor and support the follow-up on audit recommendations suggested by internal audit to encourage implementation within an agreed time frame.\n\nAnalysis and verification of financial and operational information according to IAS, IFRS & other company policies and procedures.\n\nPerforming analysis on sales pattern (branch & product wise) and suggest areas where improvement will bring extensive sales figures.\n\nKeep abreast of developments in professional standards, audit requirements and advise the business accordingly.\n\nDecember 2011 to February 2013 (1 year, 3 months)\n\nInternal Audit Department of House Building Finance Company Limited (Karachi, Pakistan)\n\nAssistant Manager\n\nPerformed the internal audit assignments for Head office and Regional offices geographically disbursed in all over the country. Key roles and responsibilities included:\n\nPreparing the Internal Audit Plan on the basis of risk assessment and process understanding prevailing in business functions of the company.\n\nDeveloping the Internal Audit Engagement Planning to define audit scope, allocation of resources and schedules.\n\nDeveloping audit program detailing the control objectives and test procedures to be performed during fieldwork.\n\nDeveloping detailed work plan for the execution of audit procedures in accordance with audit program.\n\nIdentifying and highlighting the accounting and internal control system weaknesses and recommending suggestions for improvement in achieving desired efficiency and effectiveness in designed systems.\n\nEvaluating policies, procedures and terms of reference in place and identification of procedural and control gaps\/non-compliances.\n\nPerforming reviews of the fieldwork performed by support staff to monitor the progress of the assignment including quality control for the audits and to ensure that detailed audit work is effectively focused on areas assessed as high risk.\n\nDecide on audit findings to be included in the final reports to ensure that findings and recommendations are clearly presented and agreed by the management.\n\nReporting to the Chief Manager Internal Audit at the required intervals on internal audit assignments about audit status, planned reviews, investigations and any other ad-hoc activity.\n\nCoordination and Liaison with external auditors as appropriate.\n\nJuly 2011 to November 2011 (5 months)\n\nFinance and Accounts Department of Tabba Heart Institute (Karachi, Pakistan)\n\nAccounts Officer\n\nPerformed the finance and accounts activity and reported to Senior Manager Finance and Accounts. Key roles and responsibilities included:\n\nPreparation of budgets cash flows, management reports, expenditure analysis & working capital analysis.\n\nPreparation of monthly and annual budgets of the company and evaluate the reasons of variances between budgeted and actual figures and comparison with the last years.\n\nReviewing monthly payroll to employees and subsequent submission of income tax return to Tax authority on withholding tax deducted from salaries under the provisions of income tax laws.\n\nSubmission of daily cash position and weekly bank reconciliation statements to Senior Manager and CFO.\n\nPerforming analysis on insurance cover on various assets of the entity. Ensuring timely renewal and submission of insurance premium or settlement against insurance claims.\n\nDecember 2007 to June 2011 (3 years, 7 months)\n\nEnterprise Risk Services (ERS) Division of Deloitte Touche Tohmatsu International (Karachi, Pakistan)\n\nSenior Audit and Assurance\n\nDuring the period of association with the firm, I have been assigned on the audit of organisations relating to various sectors, in the capacity of audit junior to audit senior. Key roles and responsibilities included:\n\nSupervised internal audit assignments based on the guidelines of Institute of Internal Auditors and Deloitte’s Internal Audit Methodology.\n\nDeveloping the risk based Internal Audit Risk Matrix and Internal Audit Plan to define the scope of audit activities to be performed on the basis of IIA and Deloitte’s Internal Audit Methodology.\n\nPlan, organize and execute detailed audit procedures using audit programs on various business processes, including reviewing transactions, documents, reports, policies and procedures for accuracy and effectiveness.\n\nSubmission of Internal Audit Reports highlighting deficiencies and recommendations to the management.\n\nCoordinate and liaise with the client to define the nature, timing and scope of engagement.\n\nDirects, counsels and instructs support staff assigned to the engagement, and reviews their work to ensure sufficiency of engagement scope, adequacy of audit coverage and compliance of professional standards.\n\nReporting to audit manager about engagement progress and submission of Audit Reports.\n\nPerformed special assignments to develop organization’s manuals, policies and procedures, fixed asset register.\n\nDeveloping proposals for delivering quality services based on cost and time estimates.\n\nPROFESSIONAL & ACADEMIC QULIFICATIONS\n\nCourse\n\nInstitute\n\nYear\n\nStatus\n\nChartered Accountant\n\nThe Association of Chartered Certified Accountants (ACCA - UK)\n\n2014\n\nQualified Member since March 2014\n\nThe Institute of Chartered Accountants of Pakistan (ICAP)\n\n2011\n\nFinal Level – Last 2 modules remaining to qualify\n\nBachelor of Commerce\n\nUniversity of Karachi\n\n2005\n\nSecured 2nd Division (56%)\n\nIT KNOW HOW\n\nWell versed with Microsoft Family, specifically Word, Excel and Power Point and other general purpose applications including web browsers and e-mail clients.\n\nGood experience of working in computerized environment as performed audit in organizations with sound computerized information systems based on Database systems like Oracle and Oracle Financial.\n\n"}]}