{"summary":[{"Objective":":\n\nTo work in a progressive organization with highly motivating and challenging environment, providing best opportunities to grow professionally and utilize my potential skills to achieve the organization’s goal\n\n"},{"Profile Summary":":\n\nSenior Accountant with over 8 years of experience in managing finance & accounting functions; mainly budgeting, forecasting and analysis, assist in preparation of financial statements, assist external audits, supervise Qatar and Saudi Arabia branch accounting with periodic visits.\n\n"}],"skills":[{"Academic Qualifications":":\n\nC M A (U.S) – Pursuing\n\nM B A (Finance) – Master of Business Administration from Osmania University during 2004-2006\n\nB. Com – Bachelor of Commerce from Kakatiya University during 2001-2004\n\n"},{"Technical Skills":":\n\nERP : SAP – FI\/CO (Trained), Tally, Thrive & Multivision\n\nApplications : MS - Office XP, 2003, 2007, 2010\n\nCertified Diploma in office automation from C-DAC Govt. of INDIA\n\n"},{"Key Skills":" & Strengths:\n\nStrong verbal and written communication skills with ability to communicate effectively with both financial and less-financial audiences of all levels of a multi-national organization\n\nProven experience of modeling (MS excel), analytical and numerical reasoning skills with an ability to interpret and summarize multiple information streams\n\nProactive personality with superior time management skills and initiative\n\nAdvanced knowledge of Microsoft Office programs (especially MS Excel and Power point)\n\nPersonal Details:\n\n"},{"Languages":" : English, Hindi & Telugu\n\nGender : Male\n\nDate of Birth : 15\/06\/1984\n\nNationality : Indian\n\nMarital Status : Single\n\nCurrent address : C\/o Linde Engineering Middle East LLC, Abu Dhabi, UAE.\n\nPassport No : G 8 6 2 4 1 0 9\n\nVisa status : Employment Visa\n\nOthers:\n\nMember of IMA (U.S) – ID No. 000008178505\n\nHaving U.A.E Driving license and own transport\n\n"}],"basics":{"name":{"surname":"Com"},"email":["ravi.kondra@gmail.com"]},"extracurricular":[{"Banking Activities":":\n\nBank reconciliation, opening of import L\/C’s\n\nPreparation of export L\/C documents (For L\/C based clients)\n\nPreparation of application for bank guarantees\n\nCash flow:\n\nMaintenance and preparation of daily, weekly & monthly cash flows\n\nMaintenance of various receivables for cash flow projection or budgeting\n\nActively participated in ERP implementation process\n\nAssisting in monthly, quarterly & yearly closing and liaise with auditors\n\nTaking-over timely delegated tasks\n\nJul’06 to Jan’08\n\nGE Financial Services Ltd.\n\nHYDERABAD, INDIA\n\nDesignation: Finance Executive\n\nObtain details of clients from business executives\n\nAnalyze clients profile and financial statements\n\nEnsure clients assessment to meet the criteria in accordance with company norms\n\nPreparation of MIS reports with recommendations and conclusions\n\nManaging cash transactions\n\n"}],"work_experience":[{"Experience":":\n\nDec’09 to date\n\nLINDE ENGINEERING MIDDLE EAST LLC\n\nAbu Dhabi, U.A.E\n\nDesignation: Senior Accountant\n\nReporting & Analysis:\n\nResponsible for reporting and analysis of region’s financial performance\n\nPrepare yearly cash planning using SAP BW\/BI and it’s reporting on SAP based reporting system\n\nPrepare monthly financial reports, cash flow projection and other accounting related reports\n\nPreparation of CAPEX ( I nvestment M anagement) & OPEX budgeting and forecast reports\n\nAssist in preparation of monthly management reports and accompanying schedules, including “Budget vs. Actual” variance reports\n\nProvide financial analytical reports and KPI’s to higher management\n\nAccounting:\n\nInvoice verification for Multimillion projects; such as Borouge EU3, Mirfa1 and other HO related\n\nSupervising A\/R, A\/P, GL and other bank related transactions\n\nPosting month end Accruals\/ Hedge Accounting\/ Interest Earned\/ payments to supplier\n\nMonthly reconciliation of intercompany balances and other general ledger accounts\n\nHandle Fixed Asset full cycle - capitalization, depreciation run and disposal\n\nBanking\/Cash:\n\nMonthly Treasury Reporting to Linde Corporate Centre, located at Munich, Germany\n\nHandle hedging and cash flow management with multiple bank accounts\n\nHandle Treasury\/ Time deposits, FX deals and their allocation as per cash requirements\n\nMonthly bank reconciliation of AED, EUR, GBP, JPY, SAR & USD currency accounts\n\nAudits & Examinations:\n\nSupport monthly, quarterly and yearly closings as well as liaise with external auditors\n\nPreparation of all schedules as per the requirement of audit\n\nSystems:\n\nKnowledge on SAP MM, SD, PS, IM & CATS (Cross Application Time Sheets)\n\nEstablish, maintain and coordinate the implementation of accounting control procedures\n\nOthers:\n\nTrained at headquarters (Munich, Germany ) on various reporting and accounting procedures\n\nNominated & visited HQ’s in Munich, Germany for “Global Finance Meet” to represent Linde M.E\n\nCoordinate with different departments for contract\/project related matters\n\nSupport in resolving queries of group or business, effecting corrections as appropriate\nLINDE AG, Qatar Branch Responsibilities:\n\nSupervise Qatar branch accounting and monthly reporting to HQ in Munich\n\nSupervise administration activities for Qatar branch office\n\nMonitoring Tax Law’s and liaise with auditors (E&Y) for tax filing & other requirements\n\nDeal with Tax Bonds, Withholding tax, Retentions & workmen compensation etc.\n\nReview of Qatar branch salary calculations prior to approval of management\n\nSupervise bank payments in line with Qatar tax regulations\n\nMonthly visits to Linde AG Doha branch, Qatar for supervision of all branch related matters\n\nJun’08 to Dec’09\n\nCONTECH LLC\n\nDubai, U.A.E\n\nDesignation: Finance & Management Accountant\n\nAccounts Receivable:\n\nRaising invoices based on delivery notes and customer LPO’s\n\nFollow up with clients for payment\n\nPreparation of customers ageing report and reconciliation\n\nAccounts Payable:\n\nAccounting of suppliers invoice\n\nProcessing of supplier payments according to credit limit\n\nPreparation of creditors ageing report and reconciliation\n\nGeneral Ledger & etc.:\n\nMaintain Fixed Asset register and calculation of depreciation\n\nMaintain Staff advance records, Handling of Petty Cash\n\n"}],"misc":[{"Interests":" : Games, Music & Travelling\n\n"}]}