{"summary":[{"CAREER GOAL":"\n\nMy career goal is to achieve professional excellence in my work through a process of learning in combination with\n\nexperience. I wish to contribute vision, leadership conceptual and technical skills to my organization and derive a\n\nsense of an accomplishment in my endeavors.\n\n"},{"SUMMARY":"\n\nTotal 8 years 10 months of experience in AutoCAD, Micro-station, Smart Sketch including 3D experience in Smart Plant\n\n3D (SP3D) & Tekla structures (X-steel 13.0, 13.1, 14.0, 16.0 & 17.0).\n\nLittle experience in PDS (Beginner)\n\n"}],"education_and_training":[{"EDUCATION":"\n\n12th Class in Science Stream From HPBSE in 2002.\n\nB.Sc (PHY., CHEM. & MATH.) From H.P. University (SHIMLA) in 2006.\n\nDiploma in Civil Engineering From Institution Of Civil Engineers (INDIA) Ludhiana.\n\n"}],"basics":{"gender":"male","name":{"firstName":"Al","surname":"Quasimia"},"email":["sonu84d@yahoo.co.in"]},"extracurricular":[{"INTERESTS AND ACTIVITIES":" ? Playing Cricket & Listening music.\n\n? Interest in reading books, travelling & driving. ? Interested in Research & development in related software.\n\n"}],"work_experience":[{"Project":": PAPUA NEW GUYANA - LNG PROJECT (UPSTREM OIL & GAS EXPLORATION PROJECT\n\nThis is one of the single biggest industrial investments in tha PAPUA NEW GUYANA. The client of this project is\n\nEXXON MOBIL.\n\nRole & Responsibility:\n\n3D modeling of (Structures like Structure, pipe rack, Module structure, pipe supports structure & other structure like\n\nshed, vessel support structure, cooling tank, duct supports, Stair tower, Elevator structure etc…) using Smart\n\nSketch (SP3D) & Microstation software.\n\nPreparation & checking of civil & structural drawings.\n\nChecking & resolve clash of steel structural with piping model.\n\nExtraction & checking of material takeoff reports from model as well as preparation of MTO manually for concrete &\n\nsteel\n\n"},{"date_start":"Oct. 2013","organization":"Fluor","date_end":"18Apr.2014","text":"\n\nCivil\/Structural Designer\n\n? "},{"Project":": KAZAKH PROJECTS JOINT VENTURE LIMITED (PJV) Future Growth Project (Pertochemical Refinery)\n\nThis is one of the single biggest industrial investments in tha Republic of Kazakhistan. The client of this project is\n\nTENGIZCHEVROIL.\n\nRole & Responsibility:\n\n3D modeling of (Structures like Structure, pipe rack, Module structure, pipe supports structure & other structure like\n\nshed, vessel support structure, cooling tank, duct supports, Stair tower, Elevator structure etc…) using Smart\n\nSketch (SP3D) & Microstation software.\n\nPreparation & checking of civil & structural drawings.\n\nChecking & resolve clash of steel structural with piping model.\n\nExtraction & checking of material takeoff reports from model as well as preparation of MTO manually for concrete &\n\nsteel.\n\nInvolved in internal model review with other discipline team\n\nCo-ordinate with engineers & also other disciplines like electrical, plant design.\n\n"},{"date_start":"Feb. 2011","organization":"Bechtel","date_end":"Sept. 2013","text":"\n\nStructural Detailer\/Designer\n\n? "},{"Project":": Kitimat Modernization Project (Alumina Refinery)\n\nThe A$3.5 billion expansion is one of the single biggest industrial investments in tha state of British Columbia’s\n\nSouth-West region at site Kitimat. It will lift Rio-Tinto Alcan’s annual alumina production from 3.5 to 4.6\n\nmillion tones per annum and provide opportunities to improve the energy and water Efficiency of the operation.\n\nRole & Responsibility:\n\n3D modeling of (Structures like Anode Baking Furnace ,Potrooms in which reduction of alumina pallets takes place, Cast House, Anode Handling & Green Baked Storage Structures ,Cooling Water , Compressed Air System Structure ,\n\nWintriage passage Structure,pipe rack, pipe supports structure & other structure like shed, cooling tank, corse seed\n\nbuilding, duct supports, Stair tower, Elevator structure etc…) using Tekla structures\n\nPreparation & checking of structural erection drawings\n\nChecking & resolve clash of steel structural with piping model.\n\nExtraction & checking of reports from model\n\nInvolved in internal model review with designing team\n\nCo-ordinate with engineers, detailing team & also other disciplines like electrical, plant design.\n\n? "},{"Project":": Ivanpah Solar Electric Generating facility, California.\n\nIvanpah Solar Electric Generating facility Campus is a 2 X 400 MW supercritical solar heliostat hotted power plant\n\nlocated in Manhattan, New York in USA. Located in high seismic zone, involves a lot of engineering and detailing.\n\nPower plant having having three units each one have steam turbine tower which collect the solar energy from heliostat that is taken from sun, Heater Bay building & HRSG unit building is one of its kinds with huge columns and\n\nhuge connections which involve a lot of detailing. Structure amounted to 11,000 tones.\n\nRole & Responsibility:\n\n3D modeling of (turbine tower building, boiler building & other small structure like transformer support, circulating\n\nWater pipe support, caustic acid pump shed, Stair tower, Elevator, pipe support structure etc…) using Tekla structure\n\nPreparation & checking of structural erection drawings\n\nChecking & resolve clash of steel structural with piping model.\n\nExtraction & checking of reports from model\n\nCo-ordinate with engineers, detailing team & also other disciplines\n\nStructure Online Pvt. Ltd. Noida July 2006 – Feb. 2011\n\nSenior Structural Designer\n\n? "},{"Project":": Mariposa (land port of entry)\n\nThe Mariposa Land Port of Entry is one of the busiest land ports in the United States. It serves as the main port of\n\nentry for fresh produce entering the United States from Mexico and the primary produce distribution point on the\n\nsouthern border,\n\nTotal Cost of Construction: $213 million\n\nThe project consists of the demolition and new construction of all facilities within the land port of entry. This\n\nincludes primary and secondary inspection areas for both commercial and non-commercial vehicles, a new administration building, a pedestrian-processing facility, a new canine kennel, and other support structures. In\n\naddition, new southbound export processing docks and inspection areas will be sized to allow for future export\n\ninspection protocols when these programs become effective. Approximately 13 acres adjacent to the port were\n\nacquired to accommodate the expansion.\n\nAll type of Drawing and Estimating on USA Based Project Handling & CAD Designing related jobs &\n\nSolid Builder Software\n\nChecking & editing of 2D-3D modules & working drawings on United States of America based projects\n\nModeling in Tekla structures.\n\n"},{"PROJECTS":" HANDLED (S&H Steel & Alling Iron Works California)\n\n? Folsom Lake College Visual & Performing Arts Center, Sacramento California 95833.\n\n? The Ritz Carlton Hotel & Spa at Dove Mountain, Marana, Arizona.\n\n? H. Allen Hight Learing Center, Unified School District North Park Drive, Sacramento, California.\n\n? New Florence High School, Florence Unified School District 350 South Main, Florence Arizona.\n\n? Vincent L. Triggs Elementary School, XXXX W. Rome Boulevard, North Las Vegas, Nevada 89084.\n\n? The Legacy at Willow Bend, Texas.\n\n? Venture Court, Professional Plaza 41810 N. Venture Drive, Anthem , Arizona 85086.\n\n? Adelanto High School, Victor Valley Union High School District, Ontario, California 91762.\n\n? Sunrise Senior Living of Gilbert, 580 S. Gilbert Road, Gilbert Arizona.\n\n? Goodyear Spring Training Ballpark, City of Goodyear Arizona.\n\n? Clark County Fire Station No. 20 & 22, Las Vagas Nevada.\n\nOther project (MMI, skyline & technip )\n\nRole & Responsibility:\n\n3D modeling of commercial building like building, stair, ladder, handrail, canopy, joist, deck supports, etc…) using\n\nTekla structure\n\nPreparation & checking of structural erection drawings\n\nExtraction & checking of reports from model, Involved in internal model review, Co-ordinate, detailing\n\n"},{"Professional Experience":" Summary\n\n? Good Knowledge of Auto CAD 2000 to 2012 & Auto CAD-3D. ? Good Knowledge of steel structure Tekla (10.2, 11.2, 12.1, 13.0, 14.1, 15.0 & 16.0)\n\n? Good Knowledge of Microstation (v7i & v8i). ? Good Knowledge of Smart Plant Software (SP3D).\n\n? Knowledge of PDS (framework) (Beginner).\n\n"},{"PROFESSIONAL EXPERIENCE":"\n\nWS Atkins & partners Overseas, Sharjah 1 Mar2015 – Till date\n\nCivil\/Structural Designer\n\n? "},{"Project":": Master Gas Compression Station 3 & 5 – Yanbu, Saudi Arabia, Client Saudi Aramco.\n\nThis is the EPC project. The project site is located in region of Yanbu and name of the project is Master Gas\n\ncompression station 3 & 5, Saudi Arabia . The client of this project is Saudi Aramco.\n\nRole & Responsibility:\n\n3D modeling of (Structures like Foundation, concrete pipe rack, steel pipe rack, Module structure, pipe supports\n\nstructure, shed, vessel support structure, cooling tank, Stair tower etc…) using SP3D & Smart Sketch software.\n\nPreparation of drawing in Micro Station and Smart Sketch, which includes the foundation of the horizontal &\n\nvertical vessels, foundation of exchanger, vertical & horizontal equipment, pipe rack, transformer foundation. Also\n\ninvolve to prepare the cooler structure, pipe rack, equipment platform etc…\n\nPreparation & checking of civil & structural drawings.\n\nChecking & resolve clash of steel structural with piping model.\n\nExtraction & checking of material takeoff reports from model as well as preparation of MTO manually for concrete &\n\nsteel.\n\nInvolved in internal model review with other discipline team\n\nCo-ordinate with engineers & also other disciplines like electrical & Instrumentation, plant design etc..\n\nCB&I India Pvt. Ltd. Gurgaon 21Apr.2014 – 28 Feb 2015\n\nCivil\/Structural Designer\n\n? "},{"Project":": ELBA LIQUIFACTION PROJECT – LNG ELBA ISLAND FACILITY SAVANNAH GEORGIA\n\nThis is the FEED project. The project site is located in an island name ELBA which is in between the Savannah river, state Georgia United States . The client of this project is Kinder Morgan & Shell.\n\nRole & Responsibility:\n\n3D modeling of (Structures like Foundation, concrete pipe rack, steel pipe rack, Module structure, pipe supports\n\nstructure, shed, vessel support structure, cooling tank, Stair tower etc…) using PDS & AutoCad software.\n\nPreparation of Modular movable liquefaction system drawing, which includes the foundation of the horizontal &\n\nvertical vessels, foundation of exchanger, vertical & horizontal equipment, pipe rack, transformer foundation. Also\n\ninvolve to prepare the cooler structure, pipe rack, equipment platform etc…\n\nInvolve to prepare MTO for concrete foundation & structures by calculating it manually.\n\nPreparation & checking of civil & structural drawings for FEED Deliverables.\n\nExtraction & checking of material takeoff reports from model as well as preparation of MTO manually for concrete &\n\nsteel\n\n? "}],"misc":[{"STRENGTHS":"\n\n? Hard working with in-depth understanding of all Architectural \/Structural functions.\n\n? Can with stand work pressures and meet deadlines.\n\nPERSONAL DETAILS\n\nFather Name: Mr. Bikram Ram Dharwal, Date of Birth: 30 June, 1984, Languages Known: English, Hindi & Punjabi Marital Status: Married, Passport No.: G9921019, Location Preferences: Delhi, Noida, Gurgaon,\n"}]}