{"summary":[{"Summary":" of Experience\n\nFrom 1st February 2014 till 30th September 2014 8 months\n\nWorked with Technip, Abu Dhabi in their Projects Procurement Department as a Procurement Assistant .\nDuties and Responsibilities\n\nReceive contracts requisitions and related documents prepared by concerned Users and ensure that they are properly completed and obtain adequate information to allow effective and efficient provision of required services.\n\nInitiate tendering cycle through approaching potential list of bidders for pre-qualification and \/ or expression of interest and accordingly prepare bidders list in co-ordination, as appropriate, with the User and obtain the necessary approvals.\n\nPrepare bid documents and ensure that tender documents are adequately completed prior to issuing to potential bidders.\n\nIssue invitation to Contractors \/ Consultants and ensure that all bids are conducted in a manner, which provides security of technical and commercial information provided by those bidders, and treat all bidders equally during the tendering process.\n\nLiaise with User to assist in the Technical clarifications, and where required, in major Contracts negotiations.\n\nProvide assistance and advice to the Users during Contract \/ Agreement execution, completion, including advice on interpretation of Contracts terms & conditions.  \n\nReview and recommend on Contract \/ Agreement variation orders, change or any subsequent amendment in accordance with approved delegation of authority.\n\nFrom 15 February 2009 till 30 January 2014 5 yrs\nWorked with ADMA-OPCO in their Health, Safety, Environment & Quality Assurance Division, Occupational Health Department, as Technical Assistant\nDuties and Responsibilities\n\nReports directly to Occupational Health Team Leader – OH Department Head.\n\nResponsible for of creation of Service Orders and Contracts for suppliers using MAXIMO System Software.\n\nOrganizes inter-departmental meetings.\n\nCoordinating directly with vendors and sending RFQs (request for quotations) for the procurement of give-aways to all the monthly campaigns.\n\nResponsible for booking conference rooms, refreshments\/lunch and hotel accommodations for visitors\/Consultants.\n\nPreparing all correspondence for inter-departmental circulations (memo, email, etc.).\n\nIn-charge of transportation request for the whole department.\n\nProcess flight bookings, offshore security passes for Consultants\/Instructors when needed.\n\nIn-charge of processing security clearances for the whole team.\n\nPoint of contact for external and internal Training courses.\n\nIn-charge of technical\/computer settings at the ADMA-OPCO Head Office Auditorium for all the monthly Health campaigns.\n\nIn charge for all the request and forms for the whole department.\n\nIn-charge of sending weekly report to HSE Manager.\n\nHandling all Logistic matter of the department\n\nAttends meeting with Doctors\/Consultants and other speakers from government and private Hospitals in UAE for our monthly Health Campaigns (i.e. Diabetes, Breast Cancer, Dental, Nutrition\/Diet, Ergonomics)\n\nIn-charge of the distribution of give-aways to all ADMA-OPCO employees; more than 4000 employees in onshore and offshore\n\nIn-charge of the whole preparation and inter-departmental coordination of the AED Training.\n\nPerforms other duties as assigned.\n\n2. From 02 November 2008 – 14 February 2009: 4 months\n\nWorked with Abu Dhabi National Takaful Company, subsidiary of Abu Dhabi Islamic Bank as Secretary – GM Office on a temporary assignment.\n\n3. From 01 October 2002 – till 15 May 2008: 4.5 yrs\n\nWorked with ADMA-OPCO in their Major Projects\/Brownfield Projects Division as Technical Assistant .\n\nDuties included:\n\nProviding administrative and clerical support for Pipelines Projects Manager, Team Leaders and Project Engineers.\n\nGenerate Management Reports and other related reports and analytical data on the activities of Pipeline Projects.\n\nDevelops, organizes and updates Department’s filing system.\n\nEnters and updates references for incoming documents into computer; compiles, distributes and files various documents, such as letters, agreements, variation orders, etc.;\n\nArranges for document dispatch; assists in typing of documents, memos and reports and performs various clerical duties in the Department as and when required by Department Head.\n\nTransfer of inactive documents from HQ to Corporate Archives and retrieve the document as and when needed.\n\nSelf-correspondence\n\nMaking presentation documents for management meetings\n\nTyping and all general clerical works associated with different Pipeline Projects.\n\n"}],"skills":[{"Language Skills":"\n\nHighly proficient in spoken and written English\n\nExcellent knowledge of Malayalam and Tamil.\nPersonal Details\n\nName : Aysha Beevi Anwar\n\nDate of Birth : 1968\n\nSex : Female\n\nNationality : Indian\n\nReligion : Islam\/Muslim\n\nVisa Status : On Husband’s Sponsorship\nPossess valid UAE Driving License\n"},{"Educational Qualifications":"\n\nMasters Degree in Economics\nYear of passing: 1991\n\nMadurai Kamaraj University\n\nTamilnadu, India\n\nBachelors Degree in Economics\nYear of Passing: 1989\n\nMadurai Kamaraj University\n\nTamilnadu, India\n\nBachelors Degree in Education\nYear of Passing: 1995\n\nMadurai Kamaraj University\n\nTamilnadu, India\nAdditional Qualification\n\nQualified Workplace Awareness Educator\n\nHealth Authority of Abu Dhabi\n\nYear: 2011\n\nParticipated in the Workplace Awareness Training Workshop for Cancer Control and Prevention and qualified as Workplace Awareness Educator in Cancer Control and Prevention conducted by Health Authority Abu Dhabi\n\nSecretarial Diploma\nYear of Passing: 1999\n\nGreenland Computers\n\nAbu Dhabi, UAE\n"},{"Other Skills":"\n\nTyping speed of 50 + words per minute.\n\nOperation of Scanner, Printer, Photocopier, etc.\n"},{"Computer Skills":"\n\nMicrosoft Windows XP\nMicrosoft Word for Windows\n\nMicrosoft Excel for Windows\n\nMicrosoft PowerPoint\n\nMicrosoft Outlook\n\nMAXIMO\n\nInternet & E-mail\n"}],"basics":{"phone":["050 6726799","055 8006655"],"name":{"surname":"Manager"},"email":["ayshasunil@gmail.com"]},"work_experience":[{"Projects":" Associated with:\n\nReplacement of 24 Nos. W. I. Lines in ZK&US\n\nReplacement of 6 Nos. W. I. Lines in Zakum Field\n\nReplacement of 5 Nos. 20 W.I. Lines in Zakum Field\n\nFEED for Replacement of 19 No. Infield Pipelines and Topsides for Zakum Oil Lines, etc\n\n4. From 01 – 31 August 2002 1 month\n\nWorked with ADMA-OPCO as Clerk\/Typist for one month (leave replacement) in their Human Resources Division.\n\n5. From 05 September 1999 to 06 October 2001 ( Two Years )\n\nWorked with Abu Dhabi Refining Company (TAKREER) in their Procurement Support Section as Registration Assistant\n\nDuties included: Updating records related to registration of companies. Entering\/updating data in the Computerised Material and Maintenance Management Systems (MAXIMO) and producing reports relating to companies registered with ATHEER, TAKREER & ADNOC. Entering of data related to Inspection & Surplus Disposal activities and assisting the Inspection Engineer in his administrative jobs. Checking all existing files of registered companies for completeness and updating by collecting relevant information from the concerned companies. Established a new filing system for easy retrieval of information. Typing and other clerical\/secretarial jobs.\n\n6. From January 1994 till October 1997 3 yrs\n\nWorked with Seven Stars Rent A Car , one of the leading car rental organisations in Abu Dhabi as Clerk\/Accounts Assistant .\n\nDuties included: Word-processing documents. Entering data related to Daily Bank Statements, Daily Accounts etc. using Microsoft Excel and another Tailor-made Program. Keeping diary of appointments and reminders. Filing, sorting and prioritising documents. Attending incoming telephone calls while the Receptionist is not available.\n"}]}