{"summary":[{"Objective":":\n\nSeeking a management position in any prestigious organization where I can play a key player in the challenging and creative management team.\n\n"}],"education_and_training":[{"EDUCATIONAL BACKGROUND":":\n\nBasic and professional Qualification:\n\nDiploma in Computing (Two years Course).\n\nSecondary School Certificate from Abu Dhabi.\n\nPetroleum and Chemical Process Technology Training Course (ADNOC Career Center)\n\n"},{"Additional Courses":":\n\nGreen Belt in Six Sigma , a highly disciplined process that help us focus on developing and delivering near-perfect services, conducted by GAMCO\n\nSystem Analysis & Design Course, from UK.\n\nIntensive English Language Courses.\n\nMicrosoft Office\n\nAdvance D-base III plus and Symphony.\n\nSKILLED QUALITIES:\n\nExcellent communication skills, good command over English and excellent in Arabic.\n\nThorough knowledge of computer software and hardware specially in the field of Aviation & MRO\n\nThorough knowledge and experience in IT Project Management.\n\nKeen to work in a challenging environment and to Learn new skills.\n\nExtensive business knowledge and organization ability.\n\nPosses a dynamic and enthusiastic personality and very flexible with ability to adapt easily to a new Environment. Innovative and believe in teamwork.\n\nJOB \/ EMPLOYMENT EXPERIENCE AND DETAILS:\n\n2003 till 2010 – Re-joined in ADAT (Abu Dhabi aircraft Technology as rename of previously known GAMCO (Gulf Aircraft Maintenance Company), IT Department as Senior Supervisor.\n\nResponsibilities included:\n\nSupervising in all aspects of IT USER SUPPORT and Service delivery.\n\nGuiding IT Support team for Maintenance, Support, Customer Care and Training\n\nReceiving quotations for different services, hardware and software and negotiating & finalizing the vendor.\n\nTaking care of Quality and Safety issues related to IT Department\n\nTravel out side of Gamco premises to represent the company in Seminars, overseas Conferences etc…\n\nAssisting the manager in IT Support development\n\nSingle handedly managed ERP implementation project in terms of special projects like Infrastructure development, acquisition of software, hardware, furniture etc.\n\n1996 to 2003 - managing our own family trading business as a full time, which enabled me to work with confidence in any organization especially in management field. It also allowed me to get wide range of business experience and indulgence in the International Caliber Projects in the field of sales and marketing, business development and management.\n\n1987 until June 1996 - GAMCO (Gulf Aircraft Maintenance Company) – started as Programmer in Computer Department gradually promoted to a senior position as Job Costing "}],"basics":{"gender":"male","name":{"firstName":"Ali","surname":"Hamood"}},"work_experience":[{"date_start":"1987","jobtitle":"Team Leader","text":", Customs Department - as Customer Officer, including one year in-house training at Finance Department, as programmer from Feb 86 until April 87.\n\n"}],"misc":[{"INTEREST AND HOBBIES":":\n\nAttending Business Conferences\n\nReading (Mainly current affairs).\n\nFootball.\n\nPage 2 of 2"}]}