{"summary":[{"CAREER OBJECTIVE":":\n\nTo work in a company where I can contribute and effectively apply and utilize my knowledge, skills and inherent potentials for the attainment of its goals; and\n\nTo assume responsibility for the position given with professional competence and to perform task with due care and diligence.\n\nPROFESSIONAL QUALIFICATION:\n\nCERTIFIED PUBLIC ACCOUNTANT\n\nProfessional Regulation Commission - Philippines\n\nOctober, 2010\n\nCAREER SERVICE PROFESSIONAL\n\nCivil Service Commission - Philippines\n\nJuly, 2009\n\n"}],"education_and_training":[{"EDUCATIONAL BACKGROUND":":\n\nCourse : Bachelor of Science in Accountancy\n\nSaint Ferdinand College\n\nIsabela, Philippines\n\nMarch 26, 2010\n\n"},{"Training":" on Project Appraisal by National Economic and Development Authority - April 15 to 17, 2013\nBottom-Up Planning and Budgeting by the Philippine Association for "}],"skills":[{"SKILLS":":\n\nHas experience in government administration and budgeting for Government Agencies;\n\nHas a basic knowledge in International Accounting Standards and IFRS;\n\nCan be able to prepare and review complete set of financial statements;\n\nHas been able to develop analytical skills and decision making (e.g. financial analysis and etc.)\n\nCan easily learn and adapt to accounting systems\/softwares;\n\nComputer literate (e.g. MS Word, MS Excel, MS Power Point, and etc.);\n\nHas a good writing and effective communication skills; and\n\nHas the ability to adapt in changing environment, can be easily trained and can work under pressure both in a team or independently.\n\nSEMINARS\/TRAININGS ATTENDED:\nTelephone Etiquette and Unified Accounts Code Structure Application Course Help Desk Implementation Training Program by Department of Budget and Management – January 7 to 8, 2015\nUnified Accounts Code Structure Application Course by Australian Department of Foreign Affairs and Trade - March 26 to 28, 2014\n"}],"basics":{"gender":"male","name":{"firstName":"JAY","surname":"SONICO"},"email":["paguiriganjayr@yahoo.com"]},"work_experience":[{"WORK EXPERIENCE":" :\n\nBudget and Management Specialist\n\nBudget and Management Bureau - F\n\nDepartment of Budget and Management\/Government of the Philippines\n\nManila, Philippines\n\nFebruary 17, 2014 to March 20, 2015\n\nBudget and Management Analyst\n\nBudget and Management Bureau - F\n\nDepartment of Budget and Management\/Government of the Philippines\n\nManila, Philippines\n\nAugust 4, 2011 to February 17, 2014\n\nDuties and responsibilities:\n\nEvaluates\/analyzes the annual Corporate Operating Budgets submitted by Government Owned and\/or Controlled Corporations (GOCCs);\n\nEvaluates and recommends the level of budgetary and funding requirements of GOCCs;\n\nAnalyzes\/evaluates budgetary requirements of GOCCs as input on the annual budget preparation process\/stage;\n\nProcesses agency requests pertaining to organization, staffing, compensation and physical resources;\n\nPrepares correspondence and replies to queries pertaining to funding, organizational modifications, position classification and compensation matters; and\n\nMaintains records of accounts and releases, and reviews of agency accountability reports.\n\nAssociate Auditor\n\nMateo, Ramos, Celestino, Llona, and Co. CPAs\n\nMakati City, Philippines\n\nJanuary 24, 2011 to July 24, 2011\n\nDuties and responsibilities:\n\nPerforms reviews on company’s transactions through vouching, tracing and making analytical procedures;\n\nPerforms audit techniques and procedures on accounts;\n\nPreparation of schedules and analysis of accounts as needed by the audit program;\n\nPrepares audit report, complete set of financial statements, proposed audit adjustments, income tax return and other reports required by the engagement;\n\nPreparation of government taxation forms and government remittances; and\n\nPrepares monthly bank reconciliation.\n\n"},{"date_start":"August 15-18, 2012","organization":"Government","text":"\nPERSONAL DATA:\n\nDate of Birth : May 17, 1990\n\nPlace of Birth : Lagawe, Ifugao, Philippines\n\nCivil Status : Single\n\nReligion : Roman Catholic\n\nSex : Male\nCHARACTER REFERENCE:\n\nMr. Teodoro T. Terrenal\n\nDepartment of Budget and Management – Manila, Philippines\n\nContact No. +639998867991\n\nMs. Sheila Marie Cua\n\nJoseph Group - UAE\n\nContact No. 0502464015\n\nMs. Vanessa Gamanos, CPA\n\nCommission on Audit – Manila, Philippines\n\nContact No. +639261165803"}]}