{"summary":[{"Job Profile":": Senior Accountant\n\n? Well versed with Accounting Packages – CODA, COGNOS, TRUST ? Maintains and balances subsidiary accounts by verifying, allocating, posting,\n\nreconciling transactions, and resolving discrepancies. ? In charge of all financial reports which are deliverables to the client on a daily,\n\nweekly and monthly basis. ? Assist in preparation of monthly management report and accompanying\n\nschedules, worksheets and narratives, including “Budget vs. Actual” variance reports.\n\n? Assist in providing follow-up and documentation of significant variances. ? Co-ordinate and resolve various issues with bank such as fund transfer clearance,\n\nbank fee anomalies, targeted balance calculations and enhancements to online services.\n\n? Responsible for monthly, quarterly and year-end closings. ? Follow up and monthly report for Accounts receivables & payables ? Making daily collection statement and receipt voucher ? Analyze revenues, commissions and expenses to ensure they are recorded\n\nappropriately on a monthly basis. ? Analyze business operations, trends, costs, revenues, financial commitments and\n\nobligations to project future revenues and expenses or to provide advice. ? Coordination with local and overseas suppliers\n\nShalu P. John Accounts & Admin Specialist\n\nMobile : 050-5261208 \/ 056-2322130\n\nE-mail: shalupjohn1@gmail.com\n\nResume of Shalu P. John\n\n2\n\n? Petty cash handling, other duties related to accounts. ? Prepare, examine and analyzing accounting records, financial statements and\n\nother financial reports to assess accuracy, completeness and conformance. ? Resolving all queries related to process. ? Preparing and maintaining of Fixed Asset Register. ? Reviewing bank reconciliations ? Redesigning of Chart of Accounts ? Preparing and maintaining of Fixed Asset Register ? Monthly and yearly closings ? Resolving disputes with banks and vendors ? Preparing financial Statements ? Preparing CAPEX budget in line with the available resources\n\nOPEL SYSTEMS & TECHNOLOGIES, KERALA, INDIA (March 1993 - December 1996) Job Profile: Accountant\n\n? Prepared monthly management accounts and performed general ledger reconciliations\n\n? Prepared the weekly and monthly payroll and all related PAYG, superfund, payroll tax and annual returns, including group tax certificates\n\n? Prepared reports summarizing the forecast company business activity and financial position.\n\n? Determined depreciation rates to apply to capital assets ? Supervised employees in the Finance and Administration Department and\n\nwas responsible for the overall direction, coordination and evaluation of this unit\n\n? Coordinated the preparation of year-end statutory accounts. ? Established and maintained relations with banks and other financial\n\ninstitutions ? Prepared reports required by regulatory agencies and arranged for audits of\n\ncompany accounts\n\n"},{"PERSONAL PROFILE":"\n\nDate of Birth : 02-05-1969 Marital Status : Married\n\nGender : Male Nationality : Indian Visas Held : UAE Residence Visa Driving : Validn UAE Driving License Languages Known : English, Hindi, Malayalam.\n\nREFERENCE\n\n? Mr. Haridas U.K Mr. Moideen Kutty Marketing Manager System Administrator United Arab Shipping Co. United Arab Shipping Co Tel: Mob. 050-6617385 Tel: Mob. 050-5820567 Certificate Attested by:- UAE Foreign Affairs, Cons. Dept.in Abu Dhabi, Ministry of\n\n"},{"OBJECTIVE":":\n\nAbility to compile, verifies, analyse and interpret the critical financial data. Experienced in acquisition accounting and mergers, competent in statutory reporting the related tasks. To aid in accomplishing the strategic goals of the organization by initiating and managing solutions to complex business problems within the scope, budget and tight schedules demanded. To seek a challenging position within the field of Accounts, Specialist, Manager and\/or Generalist, in a successful organization where I can invest all of my professional expertise, qualification, and experience to ultimately provide a professional service and add value to the organization, and secure my career growth and development for the future.\n\n"}],"education_and_training":[{"EDUCATION":": o M. Com Banking\n\nMadurai Kamaraj University, Chennai, India.\n\no MBA Financial Management National Institute of Business Management Chennai, India\n\no B.A Economics\n\nMahatma Gandhi University, Kerala, India.\n\no Pre-Degree Kerala University, Trivandrum, India\n\no Secondary School Leaving Certificate St. Joseph High School, Kerala, India.\n\nResume of Shalu P. John\n\n3\n\n"},{"CERTIFICATION COURSES":"\n\nKerala Govt. "},{"Technical Education":" : Typewriting Access Training Institute : General Manual Accounting –Advanced New Horizons : Word XP Level, Excel XP Level, Power Point Supertech Info Sys : Dac Easy St. Thomas College : Fox Base, Word Star Execu Train : Microsoft Excel for Finance & Accounts Prof. Bharath Scouts & Guides : DOS, Word Star, Windows, Win Word\n\n"},{"Education":" U.A.E, Govt. of India Min. of Human Resources Dev., Embassy of the UAE New\n\nDelhi.\n"}],"skills":[{"COMPUTER KNOWLEDGE":" Microsoft Excel : Expert Level Microsoft PowerPoint : Expert Level Microsoft Word : Expert Level Microsoft Access : Expert Level\n\nACCOUNTING PACKAGES ? CODA. ? COGNOS. ? TRUST ? DAC EASY etc.\n\n"}],"basics":{"gender":"male","name":{"surname":"John"},"title":"Manager"},"extracurricular":[{"ACTIVITIES":" & INTEREST\n\no Reading, Football.\n\n"}],"work_experience":[{"date_start":"Mar 1993","organization":"Opel","date_end":"Dec 1996","text":" Systems & Technologies, Kerala as Accountant.\n\n"},{"PROFESSIONAL EXPERIENCE":"\n\nUNITED ARAB SHIPPING, UAE (Apr 1997 – Mar 2015)\n\n"},{"PROFESSIONAL EXPERIENCE":" SUMMARY\n\n18+ years of versatile experience in Accounts & Admin, with expertise in various Programs in Accounts like TRUST, CODA, COGNOS etc.\n\n18 year plus (Apr 1997 – Mar2015) with United Arab Shipping (SAG), UAE, as Sen. Accountant 3 year plus ("}]}